podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
#define ADC_CTRL3_SCNT0_MASK                     (0x07UL << ADC_CTRL3_SCNT0_SHIFT)                   /*!< ADC0_CTRL3: SCNT0 Mask                  */
#define ADC_CTRL3_SCNT0_SHIFT                    0                                                   /*!< ADC0_CTRL3: SCNT0 Position              */
#define ADC_CTRL3_SCNT0(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT0_SHIFT))&ADC_CTRL3_SCNT0_MASK) /*!< ADC0_CTRL3                              */
#define ADC_CTRL3_SCNT1_MASK                     (0x07UL << ADC_CTRL3_SCNT1_SHIFT)                   /*!< ADC0_CTRL3: SCNT1 Mask                  */
#define ADC_CTRL3_SCNT1_SHIFT                    3                                                   /*!< ADC0_CTRL3: SCNT1 Position              */
#define ADC_CTRL3_SCNT1(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT1_SHIFT))&ADC_CTRL3_SCNT1_MASK) /*!< ADC0_CTRL3                              */
#define ADC_CTRL3_DMASRC_MASK                    (0x01UL << ADC_CTRL3_DMASRC_SHIFT)                  /*!< ADC0_CTRL3: DMASRC Mask                 */
#define ADC_CTRL3_DMASRC_SHIFT                   6                                                   /*!< ADC0_CTRL3: DMASRC Position             */
/* ------- SCHLTEN Bit Fields                       ------ */
#define ADC_SCHLTEN_SCHLTEN_MASK                 (0xFFFFUL << ADC_SCHLTEN_SCHLTEN_SHIFT)             /*!< ADC0_SCHLTEN: SCHLTEN Mask              */
#define ADC_SCHLTEN_SCHLTEN_SHIFT                0                                                   /*!< ADC0_SCHLTEN: SCHLTEN Position          */
#define ADC_SCHLTEN_SCHLTEN(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_SCHLTEN_SCHLTEN_SHIFT))&ADC_SCHLTEN_SCHLTEN_MASK) /*!< ADC0_SCHLTEN                            */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

/* ADC0 - Peripheral instance base addresses */
#define ADC0_BasePtr                   0x4005C000UL //!< Peripheral base address
#define ADC0                           ((ADC_Type *) ADC0_BasePtr) //!< Freescale base pointer
#define ADC0_BASE_PTR                  (ADC0) //!< Freescale style base pointer
/**
 * @} */ /* End group ADC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup AOI_Peripheral_access_layer_GROUP AOI Peripheral Access Layer
* @brief C Struct for AOI
* @{
*/

/* ================================================================================ */
/* ================           AOI (file:AOI_0)                     ================ */
/* ================================================================================ */

/**
 * @brief AND/OR/INVERT module
 */
/**
* @addtogroup AOI_structs_GROUP AOI struct
* @brief Struct for AOI
* @{
*/
typedef struct {                                /*       AOI Structure                                                */
   __IO uint16_t  BFCRT010;                     /**< 0000: Boolean Function Term 0 and 1 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT230;                     /**< 0002: Boolean Function Term 2 and 3 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT011;                     /**< 0004: Boolean Function Term 0 and 1 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT231;                     /**< 0006: Boolean Function Term 2 and 3 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT012;                     /**< 0008: Boolean Function Term 0 and 1 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT232;                     /**< 000A: Boolean Function Term 2 and 3 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT013;                     /**< 000C: Boolean Function Term 0 and 1 Configuration Register for EVENTn */
   __IO uint16_t  BFCRT233;                     /**< 000E: Boolean Function Term 2 and 3 Configuration Register for EVENTn */
} AOI_Type;

/**
 * @} */ /* End group AOI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'AOI' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup AOI_Register_Masks_GROUP AOI Register Masks
* @brief Register Masks for AOI
* @{
*/
/* ------- BFCRT010 Bit Fields                      ------ */
#define AOI_BFCRT010_PT1_DC_MASK                 (0x03UL << AOI_BFCRT010_PT1_DC_SHIFT)               /*!< AOI_BFCRT010: PT1_DC Mask               */
#define AOI_BFCRT010_PT1_DC_SHIFT                0                                                   /*!< AOI_BFCRT010: PT1_DC Position           */
#define AOI_BFCRT010_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT1_DC_SHIFT))&AOI_BFCRT010_PT1_DC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT1_CC_MASK                 (0x03UL << AOI_BFCRT010_PT1_CC_SHIFT)               /*!< AOI_BFCRT010: PT1_CC Mask               */
#define AOI_BFCRT010_PT1_CC_SHIFT                2                                                   /*!< AOI_BFCRT010: PT1_CC Position           */
#define AOI_BFCRT010_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT1_CC_SHIFT))&AOI_BFCRT010_PT1_CC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT1_BC_MASK                 (0x03UL << AOI_BFCRT010_PT1_BC_SHIFT)               /*!< AOI_BFCRT010: PT1_BC Mask               */
#define AOI_BFCRT010_PT1_BC_SHIFT                4                                                   /*!< AOI_BFCRT010: PT1_BC Position           */
#define AOI_BFCRT010_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT1_BC_SHIFT))&AOI_BFCRT010_PT1_BC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT1_AC_MASK                 (0x03UL << AOI_BFCRT010_PT1_AC_SHIFT)               /*!< AOI_BFCRT010: PT1_AC Mask               */
#define AOI_BFCRT010_PT1_AC_SHIFT                6                                                   /*!< AOI_BFCRT010: PT1_AC Position           */
#define AOI_BFCRT010_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT1_AC_SHIFT))&AOI_BFCRT010_PT1_AC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT0_DC_MASK                 (0x03UL << AOI_BFCRT010_PT0_DC_SHIFT)               /*!< AOI_BFCRT010: PT0_DC Mask               */
#define AOI_BFCRT010_PT0_DC_SHIFT                8                                                   /*!< AOI_BFCRT010: PT0_DC Position           */
#define AOI_BFCRT010_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT0_DC_SHIFT))&AOI_BFCRT010_PT0_DC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT0_CC_MASK                 (0x03UL << AOI_BFCRT010_PT0_CC_SHIFT)               /*!< AOI_BFCRT010: PT0_CC Mask               */
#define AOI_BFCRT010_PT0_CC_SHIFT                10                                                  /*!< AOI_BFCRT010: PT0_CC Position           */
#define AOI_BFCRT010_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT0_CC_SHIFT))&AOI_BFCRT010_PT0_CC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT0_BC_MASK                 (0x03UL << AOI_BFCRT010_PT0_BC_SHIFT)               /*!< AOI_BFCRT010: PT0_BC Mask               */
#define AOI_BFCRT010_PT0_BC_SHIFT                12                                                  /*!< AOI_BFCRT010: PT0_BC Position           */
#define AOI_BFCRT010_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT0_BC_SHIFT))&AOI_BFCRT010_PT0_BC_MASK) /*!< AOI_BFCRT010                            */
#define AOI_BFCRT010_PT0_AC_MASK                 (0x03UL << AOI_BFCRT010_PT0_AC_SHIFT)               /*!< AOI_BFCRT010: PT0_AC Mask               */
#define AOI_BFCRT010_PT0_AC_SHIFT                14                                                  /*!< AOI_BFCRT010: PT0_AC Position           */
#define AOI_BFCRT010_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT010_PT0_AC_SHIFT))&AOI_BFCRT010_PT0_AC_MASK) /*!< AOI_BFCRT010                            */
/* ------- BFCRT230 Bit Fields                      ------ */
#define AOI_BFCRT230_PT3_DC_MASK                 (0x03UL << AOI_BFCRT230_PT3_DC_SHIFT)               /*!< AOI_BFCRT230: PT3_DC Mask               */
#define AOI_BFCRT230_PT3_DC_SHIFT                0                                                   /*!< AOI_BFCRT230: PT3_DC Position           */
#define AOI_BFCRT230_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT3_DC_SHIFT))&AOI_BFCRT230_PT3_DC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT3_CC_MASK                 (0x03UL << AOI_BFCRT230_PT3_CC_SHIFT)               /*!< AOI_BFCRT230: PT3_CC Mask               */
#define AOI_BFCRT230_PT3_CC_SHIFT                2                                                   /*!< AOI_BFCRT230: PT3_CC Position           */
#define AOI_BFCRT230_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT3_CC_SHIFT))&AOI_BFCRT230_PT3_CC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT3_BC_MASK                 (0x03UL << AOI_BFCRT230_PT3_BC_SHIFT)               /*!< AOI_BFCRT230: PT3_BC Mask               */
#define AOI_BFCRT230_PT3_BC_SHIFT                4                                                   /*!< AOI_BFCRT230: PT3_BC Position           */
#define AOI_BFCRT230_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT3_BC_SHIFT))&AOI_BFCRT230_PT3_BC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT3_AC_MASK                 (0x03UL << AOI_BFCRT230_PT3_AC_SHIFT)               /*!< AOI_BFCRT230: PT3_AC Mask               */
#define AOI_BFCRT230_PT3_AC_SHIFT                6                                                   /*!< AOI_BFCRT230: PT3_AC Position           */
#define AOI_BFCRT230_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT3_AC_SHIFT))&AOI_BFCRT230_PT3_AC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT2_DC_MASK                 (0x03UL << AOI_BFCRT230_PT2_DC_SHIFT)               /*!< AOI_BFCRT230: PT2_DC Mask               */
#define AOI_BFCRT230_PT2_DC_SHIFT                8                                                   /*!< AOI_BFCRT230: PT2_DC Position           */
#define AOI_BFCRT230_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT2_DC_SHIFT))&AOI_BFCRT230_PT2_DC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT2_CC_MASK                 (0x03UL << AOI_BFCRT230_PT2_CC_SHIFT)               /*!< AOI_BFCRT230: PT2_CC Mask               */
#define AOI_BFCRT230_PT2_CC_SHIFT                10                                                  /*!< AOI_BFCRT230: PT2_CC Position           */
#define AOI_BFCRT230_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT2_CC_SHIFT))&AOI_BFCRT230_PT2_CC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT2_BC_MASK                 (0x03UL << AOI_BFCRT230_PT2_BC_SHIFT)               /*!< AOI_BFCRT230: PT2_BC Mask               */
#define AOI_BFCRT230_PT2_BC_SHIFT                12                                                  /*!< AOI_BFCRT230: PT2_BC Position           */
#define AOI_BFCRT230_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT2_BC_SHIFT))&AOI_BFCRT230_PT2_BC_MASK) /*!< AOI_BFCRT230                            */
#define AOI_BFCRT230_PT2_AC_MASK                 (0x03UL << AOI_BFCRT230_PT2_AC_SHIFT)               /*!< AOI_BFCRT230: PT2_AC Mask               */
#define AOI_BFCRT230_PT2_AC_SHIFT                14                                                  /*!< AOI_BFCRT230: PT2_AC Position           */
#define AOI_BFCRT230_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT230_PT2_AC_SHIFT))&AOI_BFCRT230_PT2_AC_MASK) /*!< AOI_BFCRT230                            */
/* ------- BFCRT011 Bit Fields                      ------ */
#define AOI_BFCRT011_PT1_DC_MASK                 (0x03UL << AOI_BFCRT011_PT1_DC_SHIFT)               /*!< AOI_BFCRT011: PT1_DC Mask               */
#define AOI_BFCRT011_PT1_DC_SHIFT                0                                                   /*!< AOI_BFCRT011: PT1_DC Position           */
#define AOI_BFCRT011_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT1_DC_SHIFT))&AOI_BFCRT011_PT1_DC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT1_CC_MASK                 (0x03UL << AOI_BFCRT011_PT1_CC_SHIFT)               /*!< AOI_BFCRT011: PT1_CC Mask               */
#define AOI_BFCRT011_PT1_CC_SHIFT                2                                                   /*!< AOI_BFCRT011: PT1_CC Position           */
#define AOI_BFCRT011_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT1_CC_SHIFT))&AOI_BFCRT011_PT1_CC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT1_BC_MASK                 (0x03UL << AOI_BFCRT011_PT1_BC_SHIFT)               /*!< AOI_BFCRT011: PT1_BC Mask               */
#define AOI_BFCRT011_PT1_BC_SHIFT                4                                                   /*!< AOI_BFCRT011: PT1_BC Position           */
#define AOI_BFCRT011_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT1_BC_SHIFT))&AOI_BFCRT011_PT1_BC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT1_AC_MASK                 (0x03UL << AOI_BFCRT011_PT1_AC_SHIFT)               /*!< AOI_BFCRT011: PT1_AC Mask               */
#define AOI_BFCRT011_PT1_AC_SHIFT                6                                                   /*!< AOI_BFCRT011: PT1_AC Position           */
#define AOI_BFCRT011_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT1_AC_SHIFT))&AOI_BFCRT011_PT1_AC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT0_DC_MASK                 (0x03UL << AOI_BFCRT011_PT0_DC_SHIFT)               /*!< AOI_BFCRT011: PT0_DC Mask               */
#define AOI_BFCRT011_PT0_DC_SHIFT                8                                                   /*!< AOI_BFCRT011: PT0_DC Position           */
#define AOI_BFCRT011_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT0_DC_SHIFT))&AOI_BFCRT011_PT0_DC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT0_CC_MASK                 (0x03UL << AOI_BFCRT011_PT0_CC_SHIFT)               /*!< AOI_BFCRT011: PT0_CC Mask               */
#define AOI_BFCRT011_PT0_CC_SHIFT                10                                                  /*!< AOI_BFCRT011: PT0_CC Position           */
#define AOI_BFCRT011_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT0_CC_SHIFT))&AOI_BFCRT011_PT0_CC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT0_BC_MASK                 (0x03UL << AOI_BFCRT011_PT0_BC_SHIFT)               /*!< AOI_BFCRT011: PT0_BC Mask               */
#define AOI_BFCRT011_PT0_BC_SHIFT                12                                                  /*!< AOI_BFCRT011: PT0_BC Position           */
#define AOI_BFCRT011_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT0_BC_SHIFT))&AOI_BFCRT011_PT0_BC_MASK) /*!< AOI_BFCRT011                            */
#define AOI_BFCRT011_PT0_AC_MASK                 (0x03UL << AOI_BFCRT011_PT0_AC_SHIFT)               /*!< AOI_BFCRT011: PT0_AC Mask               */
#define AOI_BFCRT011_PT0_AC_SHIFT                14                                                  /*!< AOI_BFCRT011: PT0_AC Position           */
#define AOI_BFCRT011_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT011_PT0_AC_SHIFT))&AOI_BFCRT011_PT0_AC_MASK) /*!< AOI_BFCRT011                            */
/* ------- BFCRT231 Bit Fields                      ------ */
#define AOI_BFCRT231_PT3_DC_MASK                 (0x03UL << AOI_BFCRT231_PT3_DC_SHIFT)               /*!< AOI_BFCRT231: PT3_DC Mask               */
#define AOI_BFCRT231_PT3_DC_SHIFT                0                                                   /*!< AOI_BFCRT231: PT3_DC Position           */
#define AOI_BFCRT231_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT3_DC_SHIFT))&AOI_BFCRT231_PT3_DC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT3_CC_MASK                 (0x03UL << AOI_BFCRT231_PT3_CC_SHIFT)               /*!< AOI_BFCRT231: PT3_CC Mask               */
#define AOI_BFCRT231_PT3_CC_SHIFT                2                                                   /*!< AOI_BFCRT231: PT3_CC Position           */
#define AOI_BFCRT231_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT3_CC_SHIFT))&AOI_BFCRT231_PT3_CC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT3_BC_MASK                 (0x03UL << AOI_BFCRT231_PT3_BC_SHIFT)               /*!< AOI_BFCRT231: PT3_BC Mask               */
#define AOI_BFCRT231_PT3_BC_SHIFT                4                                                   /*!< AOI_BFCRT231: PT3_BC Position           */
#define AOI_BFCRT231_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT3_BC_SHIFT))&AOI_BFCRT231_PT3_BC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT3_AC_MASK                 (0x03UL << AOI_BFCRT231_PT3_AC_SHIFT)               /*!< AOI_BFCRT231: PT3_AC Mask               */
#define AOI_BFCRT231_PT3_AC_SHIFT                6                                                   /*!< AOI_BFCRT231: PT3_AC Position           */
#define AOI_BFCRT231_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT3_AC_SHIFT))&AOI_BFCRT231_PT3_AC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT2_DC_MASK                 (0x03UL << AOI_BFCRT231_PT2_DC_SHIFT)               /*!< AOI_BFCRT231: PT2_DC Mask               */
#define AOI_BFCRT231_PT2_DC_SHIFT                8                                                   /*!< AOI_BFCRT231: PT2_DC Position           */
#define AOI_BFCRT231_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT2_DC_SHIFT))&AOI_BFCRT231_PT2_DC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT2_CC_MASK                 (0x03UL << AOI_BFCRT231_PT2_CC_SHIFT)               /*!< AOI_BFCRT231: PT2_CC Mask               */
#define AOI_BFCRT231_PT2_CC_SHIFT                10                                                  /*!< AOI_BFCRT231: PT2_CC Position           */
#define AOI_BFCRT231_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT2_CC_SHIFT))&AOI_BFCRT231_PT2_CC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT2_BC_MASK                 (0x03UL << AOI_BFCRT231_PT2_BC_SHIFT)               /*!< AOI_BFCRT231: PT2_BC Mask               */
#define AOI_BFCRT231_PT2_BC_SHIFT                12                                                  /*!< AOI_BFCRT231: PT2_BC Position           */
#define AOI_BFCRT231_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT2_BC_SHIFT))&AOI_BFCRT231_PT2_BC_MASK) /*!< AOI_BFCRT231                            */
#define AOI_BFCRT231_PT2_AC_MASK                 (0x03UL << AOI_BFCRT231_PT2_AC_SHIFT)               /*!< AOI_BFCRT231: PT2_AC Mask               */
#define AOI_BFCRT231_PT2_AC_SHIFT                14                                                  /*!< AOI_BFCRT231: PT2_AC Position           */
#define AOI_BFCRT231_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT231_PT2_AC_SHIFT))&AOI_BFCRT231_PT2_AC_MASK) /*!< AOI_BFCRT231                            */
/* ------- BFCRT012 Bit Fields                      ------ */
#define AOI_BFCRT012_PT1_DC_MASK                 (0x03UL << AOI_BFCRT012_PT1_DC_SHIFT)               /*!< AOI_BFCRT012: PT1_DC Mask               */
#define AOI_BFCRT012_PT1_DC_SHIFT                0                                                   /*!< AOI_BFCRT012: PT1_DC Position           */
#define AOI_BFCRT012_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT1_DC_SHIFT))&AOI_BFCRT012_PT1_DC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT1_CC_MASK                 (0x03UL << AOI_BFCRT012_PT1_CC_SHIFT)               /*!< AOI_BFCRT012: PT1_CC Mask               */
#define AOI_BFCRT012_PT1_CC_SHIFT                2                                                   /*!< AOI_BFCRT012: PT1_CC Position           */
#define AOI_BFCRT012_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT1_CC_SHIFT))&AOI_BFCRT012_PT1_CC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT1_BC_MASK                 (0x03UL << AOI_BFCRT012_PT1_BC_SHIFT)               /*!< AOI_BFCRT012: PT1_BC Mask               */
#define AOI_BFCRT012_PT1_BC_SHIFT                4                                                   /*!< AOI_BFCRT012: PT1_BC Position           */
#define AOI_BFCRT012_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT1_BC_SHIFT))&AOI_BFCRT012_PT1_BC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT1_AC_MASK                 (0x03UL << AOI_BFCRT012_PT1_AC_SHIFT)               /*!< AOI_BFCRT012: PT1_AC Mask               */
#define AOI_BFCRT012_PT1_AC_SHIFT                6                                                   /*!< AOI_BFCRT012: PT1_AC Position           */
#define AOI_BFCRT012_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT1_AC_SHIFT))&AOI_BFCRT012_PT1_AC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT0_DC_MASK                 (0x03UL << AOI_BFCRT012_PT0_DC_SHIFT)               /*!< AOI_BFCRT012: PT0_DC Mask               */
#define AOI_BFCRT012_PT0_DC_SHIFT                8                                                   /*!< AOI_BFCRT012: PT0_DC Position           */
#define AOI_BFCRT012_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT0_DC_SHIFT))&AOI_BFCRT012_PT0_DC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT0_CC_MASK                 (0x03UL << AOI_BFCRT012_PT0_CC_SHIFT)               /*!< AOI_BFCRT012: PT0_CC Mask               */
#define AOI_BFCRT012_PT0_CC_SHIFT                10                                                  /*!< AOI_BFCRT012: PT0_CC Position           */
#define AOI_BFCRT012_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT0_CC_SHIFT))&AOI_BFCRT012_PT0_CC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT0_BC_MASK                 (0x03UL << AOI_BFCRT012_PT0_BC_SHIFT)               /*!< AOI_BFCRT012: PT0_BC Mask               */
#define AOI_BFCRT012_PT0_BC_SHIFT                12                                                  /*!< AOI_BFCRT012: PT0_BC Position           */
#define AOI_BFCRT012_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT0_BC_SHIFT))&AOI_BFCRT012_PT0_BC_MASK) /*!< AOI_BFCRT012                            */
#define AOI_BFCRT012_PT0_AC_MASK                 (0x03UL << AOI_BFCRT012_PT0_AC_SHIFT)               /*!< AOI_BFCRT012: PT0_AC Mask               */
#define AOI_BFCRT012_PT0_AC_SHIFT                14                                                  /*!< AOI_BFCRT012: PT0_AC Position           */
#define AOI_BFCRT012_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<AOI_BFCRT012_PT0_AC_SHIFT))&AOI_BFCRT012_PT0_AC_MASK) /*!< AOI_BFCRT012                            */
/* ------- BFCRT232 Bit Fields                      ------ */
#define AOI_BFCRT232_PT3_DC_MASK                 (0x03UL << AOI_BFCRT232_PT3_DC_SHIFT)               /*!< AOI_BFCRT232: PT3_DC Mask               */
