podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
#define PWMA_SM2FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM2FRCTRL: FRAC_PU Position        */
#define PWMA_SM2FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM2FRCTRL_TEST_SHIFT)               /*!< PWMA_SM2FRCTRL: TEST Mask               */
#define PWMA_SM2FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM2FRCTRL: TEST Position           */
/* ------- SM2OCTRL Bit Fields                      ------ */
#define PWMA_SM2OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM2OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM2OCTRL: PWMXFS Mask              */
#define PWMA_SM2OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM2OCTRL: PWMXFS Position          */
#define PWMA_SM2OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMXFS_SHIFT))&PWMA_SM2OCTRL_PWMXFS_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM2OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM2OCTRL: PWMBFS Mask              */
#define PWMA_SM2OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM2OCTRL: PWMBFS Position          */
#define PWMA_SM2OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMBFS_SHIFT))&PWMA_SM2OCTRL_PWMBFS_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM2OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM2OCTRL: PWMAFS Mask              */
#define PWMA_SM2OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM2OCTRL: PWMAFS Position          */
#define PWMA_SM2OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMAFS_SHIFT))&PWMA_SM2OCTRL_PWMAFS_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_POLX_MASK                  (0x01UL << PWMA_SM2OCTRL_POLX_SHIFT)                /*!< PWMA_SM2OCTRL: POLX Mask                */
#define PWMA_SM2OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM2OCTRL: POLX Position            */
#define PWMA_SM2OCTRL_POLB_MASK                  (0x01UL << PWMA_SM2OCTRL_POLB_SHIFT)                /*!< PWMA_SM2OCTRL: POLB Mask                */
#define PWMA_SM2OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM2OCTRL: POLB Position            */
#define PWMA_SM2OCTRL_POLA_MASK                  (0x01UL << PWMA_SM2OCTRL_POLA_SHIFT)                /*!< PWMA_SM2OCTRL: POLA Mask                */
#define PWMA_SM2OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM2OCTRL: POLA Position            */
#define PWMA_SM2OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM2OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM2OCTRL: PWMX_IN Mask             */
#define PWMA_SM2OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM2OCTRL: PWMX_IN Position         */
#define PWMA_SM2OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM2OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM2OCTRL: PWMB_IN Mask             */
#define PWMA_SM2OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM2OCTRL: PWMB_IN Position         */
#define PWMA_SM2OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM2OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM2OCTRL: PWMA_IN Mask             */
#define PWMA_SM2OCTRL_PWMA_IN_SHIFT              15                                                  /*!< PWMA_SM2OCTRL: PWMA_IN Position         */
/* ------- SM2STS Bit Fields                        ------ */
#define PWMA_SM2STS_CMPF_MASK                    (0x3FUL << PWMA_SM2STS_CMPF_SHIFT)                  /*!< PWMA_SM2STS: CMPF Mask                  */
#define PWMA_SM2STS_CMPF_SHIFT                   0                                                   /*!< PWMA_SM2STS: CMPF Position              */
#define PWMA_SM2STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CMPF_SHIFT))&PWMA_SM2STS_CMPF_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFX0_MASK                    (0x01UL << PWMA_SM2STS_CFX0_SHIFT)                  /*!< PWMA_SM2STS: CFX0 Mask                  */
#define PWMA_SM2STS_CFX0_SHIFT                   6                                                   /*!< PWMA_SM2STS: CFX0 Position              */
#define PWMA_SM2STS_CFX1_MASK                    (0x01UL << PWMA_SM2STS_CFX1_SHIFT)                  /*!< PWMA_SM2STS: CFX1 Mask                  */
#define PWMA_SM2STS_CFX1_SHIFT                   7                                                   /*!< PWMA_SM2STS: CFX1 Position              */
#define PWMA_SM2STS_CFB0_MASK                    (0x01UL << PWMA_SM2STS_CFB0_SHIFT)                  /*!< PWMA_SM2STS: CFB0 Mask                  */
#define PWMA_SM2STS_CFB0_SHIFT                   8                                                   /*!< PWMA_SM2STS: CFB0 Position              */
#define PWMA_SM2STS_CFB1_MASK                    (0x01UL << PWMA_SM2STS_CFB1_SHIFT)                  /*!< PWMA_SM2STS: CFB1 Mask                  */
#define PWMA_SM2STS_CFB1_SHIFT                   9                                                   /*!< PWMA_SM2STS: CFB1 Position              */
#define PWMA_SM2STS_CFA0_MASK                    (0x01UL << PWMA_SM2STS_CFA0_SHIFT)                  /*!< PWMA_SM2STS: CFA0 Mask                  */
#define PWMA_SM2STS_CFA0_SHIFT                   10                                                  /*!< PWMA_SM2STS: CFA0 Position              */
#define PWMA_SM2STS_CFA1_MASK                    (0x01UL << PWMA_SM2STS_CFA1_SHIFT)                  /*!< PWMA_SM2STS: CFA1 Mask                  */
#define PWMA_SM2STS_CFA1_SHIFT                   11                                                  /*!< PWMA_SM2STS: CFA1 Position              */
#define PWMA_SM2STS_RF_MASK                      (0x01UL << PWMA_SM2STS_RF_SHIFT)                    /*!< PWMA_SM2STS: RF Mask                    */
#define PWMA_SM2STS_RF_SHIFT                     12                                                  /*!< PWMA_SM2STS: RF Position                */
#define PWMA_SM2STS_REF_MASK                     (0x01UL << PWMA_SM2STS_REF_SHIFT)                   /*!< PWMA_SM2STS: REF Mask                   */
#define PWMA_SM2STS_REF_SHIFT                    13                                                  /*!< PWMA_SM2STS: REF Position               */
#define PWMA_SM2STS_RUF_MASK                     (0x01UL << PWMA_SM2STS_RUF_SHIFT)                   /*!< PWMA_SM2STS: RUF Mask                   */
#define PWMA_SM2STS_RUF_SHIFT                    14                                                  /*!< PWMA_SM2STS: RUF Position               */
/* ------- SM2INTEN Bit Fields                      ------ */
#define PWMA_SM2INTEN_CMPIE_MASK                 (0x3FUL << PWMA_SM2INTEN_CMPIE_SHIFT)               /*!< PWMA_SM2INTEN: CMPIE Mask               */
#define PWMA_SM2INTEN_CMPIE_SHIFT                0                                                   /*!< PWMA_SM2INTEN: CMPIE Position           */
#define PWMA_SM2INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CMPIE_SHIFT))&PWMA_SM2INTEN_CMPIE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CX0IE_MASK                 (0x01UL << PWMA_SM2INTEN_CX0IE_SHIFT)               /*!< PWMA_SM2INTEN: CX0IE Mask               */
#define PWMA_SM2INTEN_CX0IE_SHIFT                6                                                   /*!< PWMA_SM2INTEN: CX0IE Position           */
#define PWMA_SM2INTEN_CX1IE_MASK                 (0x01UL << PWMA_SM2INTEN_CX1IE_SHIFT)               /*!< PWMA_SM2INTEN: CX1IE Mask               */
#define PWMA_SM2INTEN_CX1IE_SHIFT                7                                                   /*!< PWMA_SM2INTEN: CX1IE Position           */
#define PWMA_SM2INTEN_CB0IE_MASK                 (0x01UL << PWMA_SM2INTEN_CB0IE_SHIFT)               /*!< PWMA_SM2INTEN: CB0IE Mask               */
#define PWMA_SM2INTEN_CB0IE_SHIFT                8                                                   /*!< PWMA_SM2INTEN: CB0IE Position           */
#define PWMA_SM2INTEN_CB1IE_MASK                 (0x01UL << PWMA_SM2INTEN_CB1IE_SHIFT)               /*!< PWMA_SM2INTEN: CB1IE Mask               */
#define PWMA_SM2INTEN_CB1IE_SHIFT                9                                                   /*!< PWMA_SM2INTEN: CB1IE Position           */
#define PWMA_SM2INTEN_CA0IE_MASK                 (0x01UL << PWMA_SM2INTEN_CA0IE_SHIFT)               /*!< PWMA_SM2INTEN: CA0IE Mask               */
#define PWMA_SM2INTEN_CA0IE_SHIFT                10                                                  /*!< PWMA_SM2INTEN: CA0IE Position           */
#define PWMA_SM2INTEN_CA1IE_MASK                 (0x01UL << PWMA_SM2INTEN_CA1IE_SHIFT)               /*!< PWMA_SM2INTEN: CA1IE Mask               */
#define PWMA_SM2INTEN_CA1IE_SHIFT                11                                                  /*!< PWMA_SM2INTEN: CA1IE Position           */
#define PWMA_SM2INTEN_RIE_MASK                   (0x01UL << PWMA_SM2INTEN_RIE_SHIFT)                 /*!< PWMA_SM2INTEN: RIE Mask                 */
#define PWMA_SM2INTEN_RIE_SHIFT                  12                                                  /*!< PWMA_SM2INTEN: RIE Position             */
#define PWMA_SM2INTEN_REIE_MASK                  (0x01UL << PWMA_SM2INTEN_REIE_SHIFT)                /*!< PWMA_SM2INTEN: REIE Mask                */
#define PWMA_SM2INTEN_REIE_SHIFT                 13                                                  /*!< PWMA_SM2INTEN: REIE Position            */
/* ------- SM2DMAEN Bit Fields                      ------ */
#define PWMA_SM2DMAEN_CX0DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CX0DE_SHIFT)               /*!< PWMA_SM2DMAEN: CX0DE Mask               */
#define PWMA_SM2DMAEN_CX0DE_SHIFT                0                                                   /*!< PWMA_SM2DMAEN: CX0DE Position           */
#define PWMA_SM2DMAEN_CX1DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CX1DE_SHIFT)               /*!< PWMA_SM2DMAEN: CX1DE Mask               */
#define PWMA_SM2DMAEN_CX1DE_SHIFT                1                                                   /*!< PWMA_SM2DMAEN: CX1DE Position           */
#define PWMA_SM2DMAEN_CB0DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CB0DE_SHIFT)               /*!< PWMA_SM2DMAEN: CB0DE Mask               */
#define PWMA_SM2DMAEN_CB0DE_SHIFT                2                                                   /*!< PWMA_SM2DMAEN: CB0DE Position           */
#define PWMA_SM2DMAEN_CB1DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CB1DE_SHIFT)               /*!< PWMA_SM2DMAEN: CB1DE Mask               */
#define PWMA_SM2DMAEN_CB1DE_SHIFT                3                                                   /*!< PWMA_SM2DMAEN: CB1DE Position           */
#define PWMA_SM2DMAEN_CA0DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CA0DE_SHIFT)               /*!< PWMA_SM2DMAEN: CA0DE Mask               */
#define PWMA_SM2DMAEN_CA0DE_SHIFT                4                                                   /*!< PWMA_SM2DMAEN: CA0DE Position           */
#define PWMA_SM2DMAEN_CA1DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CA1DE_SHIFT)               /*!< PWMA_SM2DMAEN: CA1DE Mask               */
#define PWMA_SM2DMAEN_CA1DE_SHIFT                5                                                   /*!< PWMA_SM2DMAEN: CA1DE Position           */
#define PWMA_SM2DMAEN_CAPTDE_MASK                (0x03UL << PWMA_SM2DMAEN_CAPTDE_SHIFT)              /*!< PWMA_SM2DMAEN: CAPTDE Mask              */
#define PWMA_SM2DMAEN_CAPTDE_SHIFT               6                                                   /*!< PWMA_SM2DMAEN: CAPTDE Position          */
#define PWMA_SM2DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CAPTDE_SHIFT))&PWMA_SM2DMAEN_CAPTDE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_FAND_MASK                  (0x01UL << PWMA_SM2DMAEN_FAND_SHIFT)                /*!< PWMA_SM2DMAEN: FAND Mask                */
#define PWMA_SM2DMAEN_FAND_SHIFT                 8                                                   /*!< PWMA_SM2DMAEN: FAND Position            */
#define PWMA_SM2DMAEN_VALDE_MASK                 (0x01UL << PWMA_SM2DMAEN_VALDE_SHIFT)               /*!< PWMA_SM2DMAEN: VALDE Mask               */
#define PWMA_SM2DMAEN_VALDE_SHIFT                9                                                   /*!< PWMA_SM2DMAEN: VALDE Position           */
/* ------- SM2TCTRL Bit Fields                      ------ */
#define PWMA_SM2TCTRL_OUT_TRIG_EN_MASK           (0x3FUL << PWMA_SM2TCTRL_OUT_TRIG_EN_SHIFT)         /*!< PWMA_SM2TCTRL: OUT_TRIG_EN Mask         */
#define PWMA_SM2TCTRL_OUT_TRIG_EN_SHIFT          0                                                   /*!< PWMA_SM2TCTRL: OUT_TRIG_EN Position     */
#define PWMA_SM2TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_SM2TCTRL_OUT_TRIG_EN_MASK) /*!< PWMA_SM2TCTRL                           */
#define PWMA_SM2TCTRL_PWBOT1_MASK                (0x01UL << PWMA_SM2TCTRL_PWBOT1_SHIFT)              /*!< PWMA_SM2TCTRL: PWBOT1 Mask              */
#define PWMA_SM2TCTRL_PWBOT1_SHIFT               14                                                  /*!< PWMA_SM2TCTRL: PWBOT1 Position          */
#define PWMA_SM2TCTRL_PWAOT0_MASK                (0x01UL << PWMA_SM2TCTRL_PWAOT0_SHIFT)              /*!< PWMA_SM2TCTRL: PWAOT0 Mask              */
#define PWMA_SM2TCTRL_PWAOT0_SHIFT               15                                                  /*!< PWMA_SM2TCTRL: PWAOT0 Position          */
/* ------- SM2DISMAP0 Bit Fields                    ------ */
#define PWMA_SM2DISMAP0_DIS0A_MASK               (0x0FUL << PWMA_SM2DISMAP0_DIS0A_SHIFT)             /*!< PWMA_SM2DISMAP0: DIS0A Mask             */
#define PWMA_SM2DISMAP0_DIS0A_SHIFT              0                                                   /*!< PWMA_SM2DISMAP0: DIS0A Position         */
#define PWMA_SM2DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DISMAP0_DIS0A_SHIFT))&PWMA_SM2DISMAP0_DIS0A_MASK) /*!< PWMA_SM2DISMAP0                         */
#define PWMA_SM2DISMAP0_DIS0B_MASK               (0x0FUL << PWMA_SM2DISMAP0_DIS0B_SHIFT)             /*!< PWMA_SM2DISMAP0: DIS0B Mask             */
#define PWMA_SM2DISMAP0_DIS0B_SHIFT              4                                                   /*!< PWMA_SM2DISMAP0: DIS0B Position         */
#define PWMA_SM2DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DISMAP0_DIS0B_SHIFT))&PWMA_SM2DISMAP0_DIS0B_MASK) /*!< PWMA_SM2DISMAP0                         */
#define PWMA_SM2DISMAP0_DIS0X_MASK               (0x0FUL << PWMA_SM2DISMAP0_DIS0X_SHIFT)             /*!< PWMA_SM2DISMAP0: DIS0X Mask             */
#define PWMA_SM2DISMAP0_DIS0X_SHIFT              8                                                   /*!< PWMA_SM2DISMAP0: DIS0X Position         */
#define PWMA_SM2DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DISMAP0_DIS0X_SHIFT))&PWMA_SM2DISMAP0_DIS0X_MASK) /*!< PWMA_SM2DISMAP0                         */
/* ------- SM2DTCNT Bit Fields                      ------ */
#define PWMA_SM2DTCNT_DTCNT0_MASK                (0x7FFUL << PWMA_SM2DTCNT_DTCNT0_SHIFT)             /*!< PWMA_SM2DTCNT: DTCNT0 Mask              */
#define PWMA_SM2DTCNT_DTCNT0_SHIFT               0                                                   /*!< PWMA_SM2DTCNT: DTCNT0 Position          */
#define PWMA_SM2DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DTCNT_DTCNT0_SHIFT))&PWMA_SM2DTCNT_DTCNT0_MASK) /*!< PWMA_SM2DTCNT                           */
/* ------- SM2CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM2CAPTCTRLA_ARMA_MASK              (0x01UL << PWMA_SM2CAPTCTRLA_ARMA_SHIFT)            /*!< PWMA_SM2CAPTCTRLA: ARMA Mask            */
#define PWMA_SM2CAPTCTRLA_ARMA_SHIFT             0                                                   /*!< PWMA_SM2CAPTCTRLA: ARMA Position        */
#define PWMA_SM2CAPTCTRLA_ONESHOTA_MASK          (0x01UL << PWMA_SM2CAPTCTRLA_ONESHOTA_SHIFT)        /*!< PWMA_SM2CAPTCTRLA: ONESHOTA Mask        */
#define PWMA_SM2CAPTCTRLA_ONESHOTA_SHIFT         1                                                   /*!< PWMA_SM2CAPTCTRLA: ONESHOTA Position    */
#define PWMA_SM2CAPTCTRLA_EDGA0_MASK             (0x03UL << PWMA_SM2CAPTCTRLA_EDGA0_SHIFT)           /*!< PWMA_SM2CAPTCTRLA: EDGA0 Mask           */
#define PWMA_SM2CAPTCTRLA_EDGA0_SHIFT            2                                                   /*!< PWMA_SM2CAPTCTRLA: EDGA0 Position       */
#define PWMA_SM2CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_EDGA0_SHIFT))&PWMA_SM2CAPTCTRLA_EDGA0_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_EDGA1_MASK             (0x03UL << PWMA_SM2CAPTCTRLA_EDGA1_SHIFT)           /*!< PWMA_SM2CAPTCTRLA: EDGA1 Mask           */
#define PWMA_SM2CAPTCTRLA_EDGA1_SHIFT            4                                                   /*!< PWMA_SM2CAPTCTRLA: EDGA1 Position       */
#define PWMA_SM2CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_EDGA1_SHIFT))&PWMA_SM2CAPTCTRLA_EDGA1_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_INP_SELA_MASK          (0x01UL << PWMA_SM2CAPTCTRLA_INP_SELA_SHIFT)        /*!< PWMA_SM2CAPTCTRLA: INP_SELA Mask        */
#define PWMA_SM2CAPTCTRLA_INP_SELA_SHIFT         6                                                   /*!< PWMA_SM2CAPTCTRLA: INP_SELA Position    */
#define PWMA_SM2CAPTCTRLA_EDGCNTA_EN_MASK        (0x01UL << PWMA_SM2CAPTCTRLA_EDGCNTA_EN_SHIFT)      /*!< PWMA_SM2CAPTCTRLA: EDGCNTA_EN Mask      */
#define PWMA_SM2CAPTCTRLA_EDGCNTA_EN_SHIFT       7                                                   /*!< PWMA_SM2CAPTCTRLA: EDGCNTA_EN Position  */
#define PWMA_SM2CAPTCTRLA_CFAWM_MASK             (0x03UL << PWMA_SM2CAPTCTRLA_CFAWM_SHIFT)           /*!< PWMA_SM2CAPTCTRLA: CFAWM Mask           */
#define PWMA_SM2CAPTCTRLA_CFAWM_SHIFT            8                                                   /*!< PWMA_SM2CAPTCTRLA: CFAWM Position       */
#define PWMA_SM2CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_CFAWM_SHIFT))&PWMA_SM2CAPTCTRLA_CFAWM_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_CA0CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLA_CA0CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLA: CA0CNT Mask          */
#define PWMA_SM2CAPTCTRLA_CA0CNT_SHIFT           10                                                  /*!< PWMA_SM2CAPTCTRLA: CA0CNT Position      */
#define PWMA_SM2CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_CA0CNT_SHIFT))&PWMA_SM2CAPTCTRLA_CA0CNT_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_CA1CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLA_CA1CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLA: CA1CNT Mask          */
#define PWMA_SM2CAPTCTRLA_CA1CNT_SHIFT           13                                                  /*!< PWMA_SM2CAPTCTRLA: CA1CNT Position      */
#define PWMA_SM2CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_CA1CNT_SHIFT))&PWMA_SM2CAPTCTRLA_CA1CNT_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
/* ------- SM2CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPA_EDGCMPA_MASK           (0xFFUL << PWMA_SM2CAPTCOMPA_EDGCMPA_SHIFT)         /*!< PWMA_SM2CAPTCOMPA: EDGCMPA Mask         */
#define PWMA_SM2CAPTCOMPA_EDGCMPA_SHIFT          0                                                   /*!< PWMA_SM2CAPTCOMPA: EDGCMPA Position     */
#define PWMA_SM2CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPA_EDGCMPA_SHIFT))&PWMA_SM2CAPTCOMPA_EDGCMPA_MASK) /*!< PWMA_SM2CAPTCOMPA                       */
#define PWMA_SM2CAPTCOMPA_EDGCNTA_MASK           (0xFFUL << PWMA_SM2CAPTCOMPA_EDGCNTA_SHIFT)         /*!< PWMA_SM2CAPTCOMPA: EDGCNTA Mask         */
#define PWMA_SM2CAPTCOMPA_EDGCNTA_SHIFT          8                                                   /*!< PWMA_SM2CAPTCOMPA: EDGCNTA Position     */
#define PWMA_SM2CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPA_EDGCNTA_SHIFT))&PWMA_SM2CAPTCOMPA_EDGCNTA_MASK) /*!< PWMA_SM2CAPTCOMPA                       */
/* ------- SM2CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM2CAPTCTRLB_ARMB_MASK              (0x01UL << PWMA_SM2CAPTCTRLB_ARMB_SHIFT)            /*!< PWMA_SM2CAPTCTRLB: ARMB Mask            */
#define PWMA_SM2CAPTCTRLB_ARMB_SHIFT             0                                                   /*!< PWMA_SM2CAPTCTRLB: ARMB Position        */
#define PWMA_SM2CAPTCTRLB_ONESHOTB_MASK          (0x01UL << PWMA_SM2CAPTCTRLB_ONESHOTB_SHIFT)        /*!< PWMA_SM2CAPTCTRLB: ONESHOTB Mask        */
#define PWMA_SM2CAPTCTRLB_ONESHOTB_SHIFT         1                                                   /*!< PWMA_SM2CAPTCTRLB: ONESHOTB Position    */
#define PWMA_SM2CAPTCTRLB_EDGB0_MASK             (0x03UL << PWMA_SM2CAPTCTRLB_EDGB0_SHIFT)           /*!< PWMA_SM2CAPTCTRLB: EDGB0 Mask           */
#define PWMA_SM2CAPTCTRLB_EDGB0_SHIFT            2                                                   /*!< PWMA_SM2CAPTCTRLB: EDGB0 Position       */
#define PWMA_SM2CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_EDGB0_SHIFT))&PWMA_SM2CAPTCTRLB_EDGB0_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_EDGB1_MASK             (0x03UL << PWMA_SM2CAPTCTRLB_EDGB1_SHIFT)           /*!< PWMA_SM2CAPTCTRLB: EDGB1 Mask           */
#define PWMA_SM2CAPTCTRLB_EDGB1_SHIFT            4                                                   /*!< PWMA_SM2CAPTCTRLB: EDGB1 Position       */
#define PWMA_SM2CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_EDGB1_SHIFT))&PWMA_SM2CAPTCTRLB_EDGB1_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_INP_SELB_MASK          (0x01UL << PWMA_SM2CAPTCTRLB_INP_SELB_SHIFT)        /*!< PWMA_SM2CAPTCTRLB: INP_SELB Mask        */
#define PWMA_SM2CAPTCTRLB_INP_SELB_SHIFT         6                                                   /*!< PWMA_SM2CAPTCTRLB: INP_SELB Position    */
#define PWMA_SM2CAPTCTRLB_EDGCNTB_EN_MASK        (0x01UL << PWMA_SM2CAPTCTRLB_EDGCNTB_EN_SHIFT)      /*!< PWMA_SM2CAPTCTRLB: EDGCNTB_EN Mask      */
#define PWMA_SM2CAPTCTRLB_EDGCNTB_EN_SHIFT       7                                                   /*!< PWMA_SM2CAPTCTRLB: EDGCNTB_EN Position  */
#define PWMA_SM2CAPTCTRLB_CFBWM_MASK             (0x03UL << PWMA_SM2CAPTCTRLB_CFBWM_SHIFT)           /*!< PWMA_SM2CAPTCTRLB: CFBWM Mask           */
#define PWMA_SM2CAPTCTRLB_CFBWM_SHIFT            8                                                   /*!< PWMA_SM2CAPTCTRLB: CFBWM Position       */
#define PWMA_SM2CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_CFBWM_SHIFT))&PWMA_SM2CAPTCTRLB_CFBWM_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_CB0CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLB_CB0CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLB: CB0CNT Mask          */
#define PWMA_SM2CAPTCTRLB_CB0CNT_SHIFT           10                                                  /*!< PWMA_SM2CAPTCTRLB: CB0CNT Position      */
#define PWMA_SM2CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_CB0CNT_SHIFT))&PWMA_SM2CAPTCTRLB_CB0CNT_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
