podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
#define PWMA_SM2CAPTCTRLB_CB1CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLB_CB1CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLB: CB1CNT Mask          */
#define PWMA_SM2CAPTCTRLB_CB1CNT_SHIFT           13                                                  /*!< PWMA_SM2CAPTCTRLB: CB1CNT Position      */
#define PWMA_SM2CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_CB1CNT_SHIFT))&PWMA_SM2CAPTCTRLB_CB1CNT_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
/* ------- SM2CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPB_EDGCMPB_MASK           (0xFFUL << PWMA_SM2CAPTCOMPB_EDGCMPB_SHIFT)         /*!< PWMA_SM2CAPTCOMPB: EDGCMPB Mask         */
#define PWMA_SM2CAPTCOMPB_EDGCMPB_SHIFT          0                                                   /*!< PWMA_SM2CAPTCOMPB: EDGCMPB Position     */
#define PWMA_SM2CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_SM2CAPTCOMPB_EDGCMPB_MASK) /*!< PWMA_SM2CAPTCOMPB                       */
#define PWMA_SM2CAPTCOMPB_EDGCNTB_MASK           (0xFFUL << PWMA_SM2CAPTCOMPB_EDGCNTB_SHIFT)         /*!< PWMA_SM2CAPTCOMPB: EDGCNTB Mask         */
#define PWMA_SM2CAPTCOMPB_EDGCNTB_SHIFT          8                                                   /*!< PWMA_SM2CAPTCOMPB: EDGCNTB Position     */
#define PWMA_SM2CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_SM2CAPTCOMPB_EDGCNTB_MASK) /*!< PWMA_SM2CAPTCOMPB                       */
/* ------- SM2CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM2CAPTCTRLX_ARMX_MASK              (0x01UL << PWMA_SM2CAPTCTRLX_ARMX_SHIFT)            /*!< PWMA_SM2CAPTCTRLX: ARMX Mask            */
#define PWMA_SM2CAPTCTRLX_ARMX_SHIFT             0                                                   /*!< PWMA_SM2CAPTCTRLX: ARMX Position        */
#define PWMA_SM2CAPTCTRLX_ONESHOTX_MASK          (0x01UL << PWMA_SM2CAPTCTRLX_ONESHOTX_SHIFT)        /*!< PWMA_SM2CAPTCTRLX: ONESHOTX Mask        */
#define PWMA_SM2CAPTCTRLX_ONESHOTX_SHIFT         1                                                   /*!< PWMA_SM2CAPTCTRLX: ONESHOTX Position    */
#define PWMA_SM2CAPTCTRLX_EDGX0_MASK             (0x03UL << PWMA_SM2CAPTCTRLX_EDGX0_SHIFT)           /*!< PWMA_SM2CAPTCTRLX: EDGX0 Mask           */
#define PWMA_SM2CAPTCTRLX_EDGX0_SHIFT            2                                                   /*!< PWMA_SM2CAPTCTRLX: EDGX0 Position       */
#define PWMA_SM2CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_EDGX0_SHIFT))&PWMA_SM2CAPTCTRLX_EDGX0_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_EDGX1_MASK             (0x03UL << PWMA_SM2CAPTCTRLX_EDGX1_SHIFT)           /*!< PWMA_SM2CAPTCTRLX: EDGX1 Mask           */
#define PWMA_SM2CAPTCTRLX_EDGX1_SHIFT            4                                                   /*!< PWMA_SM2CAPTCTRLX: EDGX1 Position       */
#define PWMA_SM2CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_EDGX1_SHIFT))&PWMA_SM2CAPTCTRLX_EDGX1_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_INP_SELX_MASK          (0x01UL << PWMA_SM2CAPTCTRLX_INP_SELX_SHIFT)        /*!< PWMA_SM2CAPTCTRLX: INP_SELX Mask        */
#define PWMA_SM2CAPTCTRLX_INP_SELX_SHIFT         6                                                   /*!< PWMA_SM2CAPTCTRLX: INP_SELX Position    */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN_MASK        (0x01UL << PWMA_SM2CAPTCTRLX_EDGCNTX_EN_SHIFT)      /*!< PWMA_SM2CAPTCTRLX: EDGCNTX_EN Mask      */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN_SHIFT       7                                                   /*!< PWMA_SM2CAPTCTRLX: EDGCNTX_EN Position  */
#define PWMA_SM2CAPTCTRLX_CFXWM_MASK             (0x03UL << PWMA_SM2CAPTCTRLX_CFXWM_SHIFT)           /*!< PWMA_SM2CAPTCTRLX: CFXWM Mask           */
#define PWMA_SM2CAPTCTRLX_CFXWM_SHIFT            8                                                   /*!< PWMA_SM2CAPTCTRLX: CFXWM Position       */
#define PWMA_SM2CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_CFXWM_SHIFT))&PWMA_SM2CAPTCTRLX_CFXWM_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_CX0CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLX: CX0CNT Mask          */
#define PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT           10                                                  /*!< PWMA_SM2CAPTCTRLX: CX0CNT Position      */
#define PWMA_SM2CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT))&PWMA_SM2CAPTCTRLX_CX0CNT_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_CX1CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLX: CX1CNT Mask          */
#define PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT           13                                                  /*!< PWMA_SM2CAPTCTRLX: CX1CNT Position      */
#define PWMA_SM2CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT))&PWMA_SM2CAPTCTRLX_CX1CNT_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
/* ------- SM2CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPX_EDGCMPX_MASK           (0xFFUL << PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT)         /*!< PWMA_SM2CAPTCOMPX: EDGCMPX Mask         */
#define PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT          0                                                   /*!< PWMA_SM2CAPTCOMPX: EDGCMPX Position     */
#define PWMA_SM2CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_SM2CAPTCOMPX_EDGCMPX_MASK) /*!< PWMA_SM2CAPTCOMPX                       */
#define PWMA_SM2CAPTCOMPX_EDGCNTX_MASK           (0xFFUL << PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT)         /*!< PWMA_SM2CAPTCOMPX: EDGCNTX Mask         */
#define PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT          8                                                   /*!< PWMA_SM2CAPTCOMPX: EDGCNTX Position     */
#define PWMA_SM2CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_SM2CAPTCOMPX_EDGCNTX_MASK) /*!< PWMA_SM2CAPTCOMPX                       */
/* ------- SM2CVAL0 Bit Fields                      ------ */
#define PWMA_SM2CVAL0_CAPTVAL0_MASK              (0xFFFFUL << PWMA_SM2CVAL0_CAPTVAL0_SHIFT)          /*!< PWMA_SM2CVAL0: CAPTVAL0 Mask            */
#define PWMA_SM2CVAL0_CAPTVAL0_SHIFT             0                                                   /*!< PWMA_SM2CVAL0: CAPTVAL0 Position        */
#define PWMA_SM2CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL0_CAPTVAL0_SHIFT))&PWMA_SM2CVAL0_CAPTVAL0_MASK) /*!< PWMA_SM2CVAL0                           */
/* ------- SM2CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL0CYC_CVAL0CYC_MASK           (0x0FUL << PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT)         /*!< PWMA_SM2CVAL0CYC: CVAL0CYC Mask         */
#define PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL0CYC: CVAL0CYC Position     */
#define PWMA_SM2CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_SM2CVAL0CYC_CVAL0CYC_MASK) /*!< PWMA_SM2CVAL0CYC                        */
/* ------- SM2CVAL1 Bit Fields                      ------ */
#define PWMA_SM2CVAL1_CAPTVAL1_MASK              (0xFFFFUL << PWMA_SM2CVAL1_CAPTVAL1_SHIFT)          /*!< PWMA_SM2CVAL1: CAPTVAL1 Mask            */
#define PWMA_SM2CVAL1_CAPTVAL1_SHIFT             0                                                   /*!< PWMA_SM2CVAL1: CAPTVAL1 Position        */
#define PWMA_SM2CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL1_CAPTVAL1_SHIFT))&PWMA_SM2CVAL1_CAPTVAL1_MASK) /*!< PWMA_SM2CVAL1                           */
/* ------- SM2CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL1CYC_CVAL1CYC_MASK           (0x0FUL << PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT)         /*!< PWMA_SM2CVAL1CYC: CVAL1CYC Mask         */
#define PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL1CYC: CVAL1CYC Position     */
#define PWMA_SM2CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_SM2CVAL1CYC_CVAL1CYC_MASK) /*!< PWMA_SM2CVAL1CYC                        */
/* ------- SM2CVAL2 Bit Fields                      ------ */
#define PWMA_SM2CVAL2_CAPTVAL2_MASK              (0xFFFFUL << PWMA_SM2CVAL2_CAPTVAL2_SHIFT)          /*!< PWMA_SM2CVAL2: CAPTVAL2 Mask            */
#define PWMA_SM2CVAL2_CAPTVAL2_SHIFT             0                                                   /*!< PWMA_SM2CVAL2: CAPTVAL2 Position        */
#define PWMA_SM2CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL2_CAPTVAL2_SHIFT))&PWMA_SM2CVAL2_CAPTVAL2_MASK) /*!< PWMA_SM2CVAL2                           */
/* ------- SM2CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL2CYC_CVAL2CYC_MASK           (0x0FUL << PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT)         /*!< PWMA_SM2CVAL2CYC: CVAL2CYC Mask         */
#define PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL2CYC: CVAL2CYC Position     */
#define PWMA_SM2CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_SM2CVAL2CYC_CVAL2CYC_MASK) /*!< PWMA_SM2CVAL2CYC                        */
/* ------- SM2CVAL3 Bit Fields                      ------ */
#define PWMA_SM2CVAL3_CAPTVAL3_MASK              (0xFFFFUL << PWMA_SM2CVAL3_CAPTVAL3_SHIFT)          /*!< PWMA_SM2CVAL3: CAPTVAL3 Mask            */
#define PWMA_SM2CVAL3_CAPTVAL3_SHIFT             0                                                   /*!< PWMA_SM2CVAL3: CAPTVAL3 Position        */
#define PWMA_SM2CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL3_CAPTVAL3_SHIFT))&PWMA_SM2CVAL3_CAPTVAL3_MASK) /*!< PWMA_SM2CVAL3                           */
/* ------- SM2CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL3CYC_CVAL3CYC_MASK           (0x0FUL << PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT)         /*!< PWMA_SM2CVAL3CYC: CVAL3CYC Mask         */
#define PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL3CYC: CVAL3CYC Position     */
#define PWMA_SM2CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_SM2CVAL3CYC_CVAL3CYC_MASK) /*!< PWMA_SM2CVAL3CYC                        */
/* ------- SM2CVAL4 Bit Fields                      ------ */
#define PWMA_SM2CVAL4_CAPTVAL4_MASK              (0xFFFFUL << PWMA_SM2CVAL4_CAPTVAL4_SHIFT)          /*!< PWMA_SM2CVAL4: CAPTVAL4 Mask            */
#define PWMA_SM2CVAL4_CAPTVAL4_SHIFT             0                                                   /*!< PWMA_SM2CVAL4: CAPTVAL4 Position        */
#define PWMA_SM2CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL4_CAPTVAL4_SHIFT))&PWMA_SM2CVAL4_CAPTVAL4_MASK) /*!< PWMA_SM2CVAL4                           */
/* ------- SM2CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL4CYC_CVAL4CYC_MASK           (0x0FUL << PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT)         /*!< PWMA_SM2CVAL4CYC: CVAL4CYC Mask         */
#define PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL4CYC: CVAL4CYC Position     */
#define PWMA_SM2CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_SM2CVAL4CYC_CVAL4CYC_MASK) /*!< PWMA_SM2CVAL4CYC                        */
/* ------- SM2CVAL5 Bit Fields                      ------ */
#define PWMA_SM2CVAL5_CAPTVAL5_MASK              (0xFFFFUL << PWMA_SM2CVAL5_CAPTVAL5_SHIFT)          /*!< PWMA_SM2CVAL5: CAPTVAL5 Mask            */
#define PWMA_SM2CVAL5_CAPTVAL5_SHIFT             0                                                   /*!< PWMA_SM2CVAL5: CAPTVAL5 Position        */
#define PWMA_SM2CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL5_CAPTVAL5_SHIFT))&PWMA_SM2CVAL5_CAPTVAL5_MASK) /*!< PWMA_SM2CVAL5                           */
/* ------- SM2CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL5CYC_CVAL5CYC_MASK           (0x0FUL << PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT)         /*!< PWMA_SM2CVAL5CYC: CVAL5CYC Mask         */
#define PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL5CYC: CVAL5CYC Position     */
#define PWMA_SM2CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_SM2CVAL5CYC_CVAL5CYC_MASK) /*!< PWMA_SM2CVAL5CYC                        */
/* ------- SM3CNT Bit Fields                        ------ */
#define PWMA_SM3CNT_CNT_MASK                     (0xFFFFUL << PWMA_SM3CNT_CNT_SHIFT)                 /*!< PWMA_SM3CNT: CNT Mask                   */
#define PWMA_SM3CNT_CNT_SHIFT                    0                                                   /*!< PWMA_SM3CNT: CNT Position               */
#define PWMA_SM3CNT_CNT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CNT_CNT_SHIFT))&PWMA_SM3CNT_CNT_MASK) /*!< PWMA_SM3CNT                             */
/* ------- SM3INIT Bit Fields                       ------ */
#define PWMA_SM3INIT_INIT_MASK                   (0xFFFFUL << PWMA_SM3INIT_INIT_SHIFT)               /*!< PWMA_SM3INIT: INIT Mask                 */
#define PWMA_SM3INIT_INIT_SHIFT                  0                                                   /*!< PWMA_SM3INIT: INIT Position             */
#define PWMA_SM3INIT_INIT(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3INIT_INIT_SHIFT))&PWMA_SM3INIT_INIT_MASK) /*!< PWMA_SM3INIT                            */
/* ------- SM3CTRL2 Bit Fields                      ------ */
#define PWMA_SM3CTRL2_CLK_SEL_MASK               (0x03UL << PWMA_SM3CTRL2_CLK_SEL_SHIFT)             /*!< PWMA_SM3CTRL2: CLK_SEL Mask             */
#define PWMA_SM3CTRL2_CLK_SEL_SHIFT              0                                                   /*!< PWMA_SM3CTRL2: CLK_SEL Position         */
#define PWMA_SM3CTRL2_CLK_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_CLK_SEL_SHIFT))&PWMA_SM3CTRL2_CLK_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_RELOAD_SEL_MASK            (0x01UL << PWMA_SM3CTRL2_RELOAD_SEL_SHIFT)          /*!< PWMA_SM3CTRL2: RELOAD_SEL Mask          */
#define PWMA_SM3CTRL2_RELOAD_SEL_SHIFT           2                                                   /*!< PWMA_SM3CTRL2: RELOAD_SEL Position      */
#define PWMA_SM3CTRL2_FORCE_SEL_MASK             (0x07UL << PWMA_SM3CTRL2_FORCE_SEL_SHIFT)           /*!< PWMA_SM3CTRL2: FORCE_SEL Mask           */
#define PWMA_SM3CTRL2_FORCE_SEL_SHIFT            3                                                   /*!< PWMA_SM3CTRL2: FORCE_SEL Position       */
#define PWMA_SM3CTRL2_FORCE_SEL(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_FORCE_SEL_SHIFT))&PWMA_SM3CTRL2_FORCE_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_FORCE_MASK                 (0x01UL << PWMA_SM3CTRL2_FORCE_SHIFT)               /*!< PWMA_SM3CTRL2: FORCE Mask               */
#define PWMA_SM3CTRL2_FORCE_SHIFT                6                                                   /*!< PWMA_SM3CTRL2: FORCE Position           */
#define PWMA_SM3CTRL2_FRCEN_MASK                 (0x01UL << PWMA_SM3CTRL2_FRCEN_SHIFT)               /*!< PWMA_SM3CTRL2: FRCEN Mask               */
#define PWMA_SM3CTRL2_FRCEN_SHIFT                7                                                   /*!< PWMA_SM3CTRL2: FRCEN Position           */
#define PWMA_SM3CTRL2_INIT_SEL_MASK              (0x03UL << PWMA_SM3CTRL2_INIT_SEL_SHIFT)            /*!< PWMA_SM3CTRL2: INIT_SEL Mask            */
#define PWMA_SM3CTRL2_INIT_SEL_SHIFT             8                                                   /*!< PWMA_SM3CTRL2: INIT_SEL Position        */
#define PWMA_SM3CTRL2_INIT_SEL(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL2_INIT_SEL_SHIFT))&PWMA_SM3CTRL2_INIT_SEL_MASK) /*!< PWMA_SM3CTRL2                           */
#define PWMA_SM3CTRL2_PWMX_INIT_MASK             (0x01UL << PWMA_SM3CTRL2_PWMX_INIT_SHIFT)           /*!< PWMA_SM3CTRL2: PWMX_INIT Mask           */
#define PWMA_SM3CTRL2_PWMX_INIT_SHIFT            10                                                  /*!< PWMA_SM3CTRL2: PWMX_INIT Position       */
#define PWMA_SM3CTRL2_PWM45_INIT_MASK            (0x01UL << PWMA_SM3CTRL2_PWM45_INIT_SHIFT)          /*!< PWMA_SM3CTRL2: PWM45_INIT Mask          */
#define PWMA_SM3CTRL2_PWM45_INIT_SHIFT           11                                                  /*!< PWMA_SM3CTRL2: PWM45_INIT Position      */
#define PWMA_SM3CTRL2_PWM23_INIT_MASK            (0x01UL << PWMA_SM3CTRL2_PWM23_INIT_SHIFT)          /*!< PWMA_SM3CTRL2: PWM23_INIT Mask          */
#define PWMA_SM3CTRL2_PWM23_INIT_SHIFT           12                                                  /*!< PWMA_SM3CTRL2: PWM23_INIT Position      */
#define PWMA_SM3CTRL2_INDEP_MASK                 (0x01UL << PWMA_SM3CTRL2_INDEP_SHIFT)               /*!< PWMA_SM3CTRL2: INDEP Mask               */
#define PWMA_SM3CTRL2_INDEP_SHIFT                13                                                  /*!< PWMA_SM3CTRL2: INDEP Position           */
#define PWMA_SM3CTRL2_WAITEN_MASK                (0x01UL << PWMA_SM3CTRL2_WAITEN_SHIFT)              /*!< PWMA_SM3CTRL2: WAITEN Mask              */
#define PWMA_SM3CTRL2_WAITEN_SHIFT               14                                                  /*!< PWMA_SM3CTRL2: WAITEN Position          */
#define PWMA_SM3CTRL2_DBGEN_MASK                 (0x01UL << PWMA_SM3CTRL2_DBGEN_SHIFT)               /*!< PWMA_SM3CTRL2: DBGEN Mask               */
#define PWMA_SM3CTRL2_DBGEN_SHIFT                15                                                  /*!< PWMA_SM3CTRL2: DBGEN Position           */
/* ------- SM3CTRL Bit Fields                       ------ */
#define PWMA_SM3CTRL_DBLEN_MASK                  (0x01UL << PWMA_SM3CTRL_DBLEN_SHIFT)                /*!< PWMA_SM3CTRL: DBLEN Mask                */
#define PWMA_SM3CTRL_DBLEN_SHIFT                 0                                                   /*!< PWMA_SM3CTRL: DBLEN Position            */
#define PWMA_SM3CTRL_DBLX_MASK                   (0x01UL << PWMA_SM3CTRL_DBLX_SHIFT)                 /*!< PWMA_SM3CTRL: DBLX Mask                 */
#define PWMA_SM3CTRL_DBLX_SHIFT                  1                                                   /*!< PWMA_SM3CTRL: DBLX Position             */
#define PWMA_SM3CTRL_LDMOD_MASK                  (0x01UL << PWMA_SM3CTRL_LDMOD_SHIFT)                /*!< PWMA_SM3CTRL: LDMOD Mask                */
#define PWMA_SM3CTRL_LDMOD_SHIFT                 2                                                   /*!< PWMA_SM3CTRL: LDMOD Position            */
#define PWMA_SM3CTRL_PRSC_MASK                   (0x07UL << PWMA_SM3CTRL_PRSC_SHIFT)                 /*!< PWMA_SM3CTRL: PRSC Mask                 */
#define PWMA_SM3CTRL_PRSC_SHIFT                  4                                                   /*!< PWMA_SM3CTRL: PRSC Position             */
#define PWMA_SM3CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_PRSC_SHIFT))&PWMA_SM3CTRL_PRSC_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_DT_MASK                     (0x03UL << PWMA_SM3CTRL_DT_SHIFT)                   /*!< PWMA_SM3CTRL: DT Mask                   */
#define PWMA_SM3CTRL_DT_SHIFT                    8                                                   /*!< PWMA_SM3CTRL: DT Position               */
#define PWMA_SM3CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_DT_SHIFT))&PWMA_SM3CTRL_DT_MASK) /*!< PWMA_SM3CTRL                            */
#define PWMA_SM3CTRL_FULL_MASK                   (0x01UL << PWMA_SM3CTRL_FULL_SHIFT)                 /*!< PWMA_SM3CTRL: FULL Mask                 */
#define PWMA_SM3CTRL_FULL_SHIFT                  10                                                  /*!< PWMA_SM3CTRL: FULL Position             */
#define PWMA_SM3CTRL_HALF_MASK                   (0x01UL << PWMA_SM3CTRL_HALF_SHIFT)                 /*!< PWMA_SM3CTRL: HALF Mask                 */
#define PWMA_SM3CTRL_HALF_SHIFT                  11                                                  /*!< PWMA_SM3CTRL: HALF Position             */
#define PWMA_SM3CTRL_LDFQ_MASK                   (0x0FUL << PWMA_SM3CTRL_LDFQ_SHIFT)                 /*!< PWMA_SM3CTRL: LDFQ Mask                 */
#define PWMA_SM3CTRL_LDFQ_SHIFT                  12                                                  /*!< PWMA_SM3CTRL: LDFQ Position             */
#define PWMA_SM3CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CTRL_LDFQ_SHIFT))&PWMA_SM3CTRL_LDFQ_MASK) /*!< PWMA_SM3CTRL                            */
/* ------- SM3VAL0 Bit Fields                       ------ */
#define PWMA_SM3VAL0_VAL0_MASK                   (0xFFFFUL << PWMA_SM3VAL0_VAL0_SHIFT)               /*!< PWMA_SM3VAL0: VAL0 Mask                 */
#define PWMA_SM3VAL0_VAL0_SHIFT                  0                                                   /*!< PWMA_SM3VAL0: VAL0 Position             */
#define PWMA_SM3VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL0_VAL0_SHIFT))&PWMA_SM3VAL0_VAL0_MASK) /*!< PWMA_SM3VAL0                            */
/* ------- SM3FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL1_FRACVAL1_MASK           (0x1FUL << PWMA_SM3FRACVAL1_FRACVAL1_SHIFT)         /*!< PWMA_SM3FRACVAL1: FRACVAL1 Mask         */
#define PWMA_SM3FRACVAL1_FRACVAL1_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL1: FRACVAL1 Position     */
#define PWMA_SM3FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL1_FRACVAL1_SHIFT))&PWMA_SM3FRACVAL1_FRACVAL1_MASK) /*!< PWMA_SM3FRACVAL1                        */
/* ------- SM3VAL1 Bit Fields                       ------ */
#define PWMA_SM3VAL1_VAL1_MASK                   (0xFFFFUL << PWMA_SM3VAL1_VAL1_SHIFT)               /*!< PWMA_SM3VAL1: VAL1 Mask                 */
#define PWMA_SM3VAL1_VAL1_SHIFT                  0                                                   /*!< PWMA_SM3VAL1: VAL1 Position             */
#define PWMA_SM3VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL1_VAL1_SHIFT))&PWMA_SM3VAL1_VAL1_MASK) /*!< PWMA_SM3VAL1                            */
/* ------- SM3FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM3FRACVAL2_FRACVAL2_MASK           (0x1FUL << PWMA_SM3FRACVAL2_FRACVAL2_SHIFT)         /*!< PWMA_SM3FRACVAL2: FRACVAL2 Mask         */
#define PWMA_SM3FRACVAL2_FRACVAL2_SHIFT          11                                                  /*!< PWMA_SM3FRACVAL2: FRACVAL2 Position     */
#define PWMA_SM3FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3FRACVAL2_FRACVAL2_SHIFT))&PWMA_SM3FRACVAL2_FRACVAL2_MASK) /*!< PWMA_SM3FRACVAL2                        */
/* ------- SM3VAL2 Bit Fields                       ------ */
#define PWMA_SM3VAL2_VAL2_MASK                   (0xFFFFUL << PWMA_SM3VAL2_VAL2_SHIFT)               /*!< PWMA_SM3VAL2: VAL2 Mask                 */
#define PWMA_SM3VAL2_VAL2_SHIFT                  0                                                   /*!< PWMA_SM3VAL2: VAL2 Position             */
#define PWMA_SM3VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM3VAL2_VAL2_SHIFT))&PWMA_SM3VAL2_VAL2_MASK) /*!< PWMA_SM3VAL2                            */
/* ------- SM3FRACVAL3 Bit Fields                   ------ */
