podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
#define SIM_SDID_DIEID_MASK                      (0x1FUL << SIM_SDID_DIEID_SHIFT)                    /*!< SIM_SDID: DIEID Mask                    */
#define SIM_SDID_DIEID_SHIFT                     7                                                   /*!< SIM_SDID: DIEID Position                */
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIEID_SHIFT))&SIM_SDID_DIEID_MASK) /*!< SIM_SDID                                */
#define SIM_SDID_REVID_MASK                      (0x0FUL << SIM_SDID_REVID_SHIFT)                    /*!< SIM_SDID: REVID Mask                    */
#define SIM_SDID_REVID_SHIFT                     12                                                  /*!< SIM_SDID: REVID Position                */
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REVID_SHIFT))&SIM_SDID_REVID_MASK) /*!< SIM_SDID                                */
#define SIM_SDID_SERIESID_MASK                   (0x0FUL << SIM_SDID_SERIESID_SHIFT)                 /*!< SIM_SDID: SERIESID Mask                 */
#define SIM_SDID_SERIESID_SHIFT                  20                                                  /*!< SIM_SDID: SERIESID Position             */
#define SIM_SDID_SERIESID(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SERIESID_SHIFT))&SIM_SDID_SERIESID_MASK) /*!< SIM_SDID                                */
#define SIM_SDID_SUBFAMID_MASK                   (0x0FUL << SIM_SDID_SUBFAMID_SHIFT)                 /*!< SIM_SDID: SUBFAMID Mask                 */
#define SIM_SDID_SUBFAMID_SHIFT                  24                                                  /*!< SIM_SDID: SUBFAMID Position             */
#define SIM_SDID_SUBFAMID(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SDID_SUBFAMID_SHIFT))&SIM_SDID_SUBFAMID_MASK) /*!< SIM_SDID                                */
#define SIM_SDID_FAMILYID_MASK                   (0x0FUL << SIM_SDID_FAMILYID_SHIFT)                 /*!< SIM_SDID: FAMILYID Mask                 */
#define SIM_SDID_FAMILYID_SHIFT                  28                                                  /*!< SIM_SDID: FAMILYID Position             */
#define SIM_SDID_FAMILYID(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_SDID_FAMILYID_SHIFT))&SIM_SDID_FAMILYID_MASK) /*!< SIM_SDID                                */
/* ------- SCGC4 Bit Fields                         ------ */
#define SIM_SCGC4_EWM_MASK                       (0x01UL << SIM_SCGC4_EWM_SHIFT)                     /*!< SIM_SCGC4: EWM Mask                     */
#define SIM_SCGC4_EWM_SHIFT                      1                                                   /*!< SIM_SCGC4: EWM Position                 */
#define SIM_SCGC4_I2C0_MASK                      (0x01UL << SIM_SCGC4_I2C0_SHIFT)                    /*!< SIM_SCGC4: I2C0 Mask                    */
#define SIM_SCGC4_I2C0_SHIFT                     6                                                   /*!< SIM_SCGC4: I2C0 Position                */
#define SIM_SCGC4_UART0_MASK                     (0x01UL << SIM_SCGC4_UART0_SHIFT)                   /*!< SIM_SCGC4: UART0 Mask                   */
#define SIM_SCGC4_UART0_SHIFT                    10                                                  /*!< SIM_SCGC4: UART0 Position               */
#define SIM_SCGC4_UART1_MASK                     (0x01UL << SIM_SCGC4_UART1_SHIFT)                   /*!< SIM_SCGC4: UART1 Mask                   */
#define SIM_SCGC4_UART1_SHIFT                    11                                                  /*!< SIM_SCGC4: UART1 Position               */
#define SIM_SCGC4_CMP_MASK                       (0x01UL << SIM_SCGC4_CMP_SHIFT)                     /*!< SIM_SCGC4: CMP Mask                     */
#define SIM_SCGC4_CMP_SHIFT                      19                                                  /*!< SIM_SCGC4: CMP Position                 */
#define SIM_SCGC4_eFlexPWM0_MASK                 (0x01UL << SIM_SCGC4_eFlexPWM0_SHIFT)               /*!< SIM_SCGC4: eFlexPWM0 Mask               */
#define SIM_SCGC4_eFlexPWM0_SHIFT                24                                                  /*!< SIM_SCGC4: eFlexPWM0 Position           */
#define SIM_SCGC4_eFlexPWM1_MASK                 (0x01UL << SIM_SCGC4_eFlexPWM1_SHIFT)               /*!< SIM_SCGC4: eFlexPWM1 Mask               */
#define SIM_SCGC4_eFlexPWM1_SHIFT                25                                                  /*!< SIM_SCGC4: eFlexPWM1 Position           */
#define SIM_SCGC4_eFlexPWM2_MASK                 (0x01UL << SIM_SCGC4_eFlexPWM2_SHIFT)               /*!< SIM_SCGC4: eFlexPWM2 Mask               */
#define SIM_SCGC4_eFlexPWM2_SHIFT                26                                                  /*!< SIM_SCGC4: eFlexPWM2 Position           */
#define SIM_SCGC4_eFlexPWM3_MASK                 (0x01UL << SIM_SCGC4_eFlexPWM3_SHIFT)               /*!< SIM_SCGC4: eFlexPWM3 Mask               */
#define SIM_SCGC4_eFlexPWM3_SHIFT                27                                                  /*!< SIM_SCGC4: eFlexPWM3 Position           */
/* ------- SCGC5 Bit Fields                         ------ */
#define SIM_SCGC5_LPTMR_MASK                     (0x01UL << SIM_SCGC5_LPTMR_SHIFT)                   /*!< SIM_SCGC5: LPTMR Mask                   */
#define SIM_SCGC5_LPTMR_SHIFT                    0                                                   /*!< SIM_SCGC5: LPTMR Position               */
#define SIM_SCGC5_PORTA_MASK                     (0x01UL << SIM_SCGC5_PORTA_SHIFT)                   /*!< SIM_SCGC5: PORTA Mask                   */
#define SIM_SCGC5_PORTA_SHIFT                    9                                                   /*!< SIM_SCGC5: PORTA Position               */
#define SIM_SCGC5_PORTB_MASK                     (0x01UL << SIM_SCGC5_PORTB_SHIFT)                   /*!< SIM_SCGC5: PORTB Mask                   */
#define SIM_SCGC5_PORTB_SHIFT                    10                                                  /*!< SIM_SCGC5: PORTB Position               */
#define SIM_SCGC5_PORTC_MASK                     (0x01UL << SIM_SCGC5_PORTC_SHIFT)                   /*!< SIM_SCGC5: PORTC Mask                   */
#define SIM_SCGC5_PORTC_SHIFT                    11                                                  /*!< SIM_SCGC5: PORTC Position               */
#define SIM_SCGC5_PORTD_MASK                     (0x01UL << SIM_SCGC5_PORTD_SHIFT)                   /*!< SIM_SCGC5: PORTD Mask                   */
#define SIM_SCGC5_PORTD_SHIFT                    12                                                  /*!< SIM_SCGC5: PORTD Position               */
#define SIM_SCGC5_PORTE_MASK                     (0x01UL << SIM_SCGC5_PORTE_SHIFT)                   /*!< SIM_SCGC5: PORTE Mask                   */
#define SIM_SCGC5_PORTE_SHIFT                    13                                                  /*!< SIM_SCGC5: PORTE Position               */
#define SIM_SCGC5_ENC_MASK                       (0x01UL << SIM_SCGC5_ENC_SHIFT)                     /*!< SIM_SCGC5: ENC Mask                     */
#define SIM_SCGC5_ENC_SHIFT                      21                                                  /*!< SIM_SCGC5: ENC Position                 */
#define SIM_SCGC5_XBARA_MASK                     (0x01UL << SIM_SCGC5_XBARA_SHIFT)                   /*!< SIM_SCGC5: XBARA Mask                   */
#define SIM_SCGC5_XBARA_SHIFT                    25                                                  /*!< SIM_SCGC5: XBARA Position               */
#define SIM_SCGC5_XBARB_MASK                     (0x01UL << SIM_SCGC5_XBARB_SHIFT)                   /*!< SIM_SCGC5: XBARB Mask                   */
#define SIM_SCGC5_XBARB_SHIFT                    26                                                  /*!< SIM_SCGC5: XBARB Position               */
#define SIM_SCGC5_AOI_MASK                       (0x01UL << SIM_SCGC5_AOI_SHIFT)                     /*!< SIM_SCGC5: AOI Mask                     */
#define SIM_SCGC5_AOI_SHIFT                      27                                                  /*!< SIM_SCGC5: AOI Position                 */
#define SIM_SCGC5_ADC_MASK                       (0x01UL << SIM_SCGC5_ADC_SHIFT)                     /*!< SIM_SCGC5: ADC Mask                     */
#define SIM_SCGC5_ADC_SHIFT                      28                                                  /*!< SIM_SCGC5: ADC Position                 */
/* ------- SCGC6 Bit Fields                         ------ */
#define SIM_SCGC6_FTF_MASK                       (0x01UL << SIM_SCGC6_FTF_SHIFT)                     /*!< SIM_SCGC6: FTF Mask                     */
#define SIM_SCGC6_FTF_SHIFT                      0                                                   /*!< SIM_SCGC6: FTF Position                 */
#define SIM_SCGC6_DMAMUX0_MASK                   (0x01UL << SIM_SCGC6_DMAMUX0_SHIFT)                 /*!< SIM_SCGC6: DMAMUX0 Mask                 */
#define SIM_SCGC6_DMAMUX0_SHIFT                  1                                                   /*!< SIM_SCGC6: DMAMUX0 Position             */
#define SIM_SCGC6_FLEXCAN0_MASK                  (0x01UL << SIM_SCGC6_FLEXCAN0_SHIFT)                /*!< SIM_SCGC6: FLEXCAN0 Mask                */
#define SIM_SCGC6_FLEXCAN0_SHIFT                 4                                                   /*!< SIM_SCGC6: FLEXCAN0 Position            */
#define SIM_SCGC6_FLEXCAN1_MASK                  (0x01UL << SIM_SCGC6_FLEXCAN1_SHIFT)                /*!< SIM_SCGC6: FLEXCAN1 Mask                */
#define SIM_SCGC6_FLEXCAN1_SHIFT                 5                                                   /*!< SIM_SCGC6: FLEXCAN1 Position            */
#define SIM_SCGC6_FTM3_MASK                      (0x01UL << SIM_SCGC6_FTM3_SHIFT)                    /*!< SIM_SCGC6: FTM3 Mask                    */
#define SIM_SCGC6_FTM3_SHIFT                     6                                                   /*!< SIM_SCGC6: FTM3 Position                */
#define SIM_SCGC6_SPI0_MASK                      (0x01UL << SIM_SCGC6_SPI0_SHIFT)                    /*!< SIM_SCGC6: SPI0 Mask                    */
#define SIM_SCGC6_SPI0_SHIFT                     12                                                  /*!< SIM_SCGC6: SPI0 Position                */
#define SIM_SCGC6_PDB1_MASK                      (0x01UL << SIM_SCGC6_PDB1_SHIFT)                    /*!< SIM_SCGC6: PDB1 Mask                    */
#define SIM_SCGC6_PDB1_SHIFT                     17                                                  /*!< SIM_SCGC6: PDB1 Position                */
#define SIM_SCGC6_CRC_MASK                       (0x01UL << SIM_SCGC6_CRC_SHIFT)                     /*!< SIM_SCGC6: CRC Mask                     */
#define SIM_SCGC6_CRC_SHIFT                      18                                                  /*!< SIM_SCGC6: CRC Position                 */
#define SIM_SCGC6_PDB0_MASK                      (0x01UL << SIM_SCGC6_PDB0_SHIFT)                    /*!< SIM_SCGC6: PDB0 Mask                    */
#define SIM_SCGC6_PDB0_SHIFT                     22                                                  /*!< SIM_SCGC6: PDB0 Position                */
#define SIM_SCGC6_PIT_MASK                       (0x01UL << SIM_SCGC6_PIT_SHIFT)                     /*!< SIM_SCGC6: PIT Mask                     */
#define SIM_SCGC6_PIT_SHIFT                      23                                                  /*!< SIM_SCGC6: PIT Position                 */
#define SIM_SCGC6_FTM0_MASK                      (0x01UL << SIM_SCGC6_FTM0_SHIFT)                    /*!< SIM_SCGC6: FTM0 Mask                    */
#define SIM_SCGC6_FTM0_SHIFT                     24                                                  /*!< SIM_SCGC6: FTM0 Position                */
#define SIM_SCGC6_FTM1_MASK                      (0x01UL << SIM_SCGC6_FTM1_SHIFT)                    /*!< SIM_SCGC6: FTM1 Mask                    */
#define SIM_SCGC6_FTM1_SHIFT                     25                                                  /*!< SIM_SCGC6: FTM1 Position                */
#define SIM_SCGC6_DAC0_MASK                      (0x01UL << SIM_SCGC6_DAC0_SHIFT)                    /*!< SIM_SCGC6: DAC0 Mask                    */
#define SIM_SCGC6_DAC0_SHIFT                     31                                                  /*!< SIM_SCGC6: DAC0 Position                */
/* ------- SCGC7 Bit Fields                         ------ */
#define SIM_SCGC7_DMA_MASK                       (0x01UL << SIM_SCGC7_DMA_SHIFT)                     /*!< SIM_SCGC7: DMA Mask                     */
#define SIM_SCGC7_DMA_SHIFT                      8                                                   /*!< SIM_SCGC7: DMA Position                 */
/* ------- CLKDIV1 Bit Fields                       ------ */
#define SIM_CLKDIV1_OUTDIV4_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV4_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV4 Mask               */
#define SIM_CLKDIV1_OUTDIV4_SHIFT                16                                                  /*!< SIM_CLKDIV1: OUTDIV4 Position           */
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV2_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV2_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV2 Mask               */
#define SIM_CLKDIV1_OUTDIV2_SHIFT                24                                                  /*!< SIM_CLKDIV1: OUTDIV2 Position           */
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV2_SHIFT))&SIM_CLKDIV1_OUTDIV2_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV1_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV1_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV1 Mask               */
#define SIM_CLKDIV1_OUTDIV1_SHIFT                28                                                  /*!< SIM_CLKDIV1: OUTDIV1 Position           */
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK) /*!< SIM_CLKDIV1                             */
/* ------- FCFG1 Bit Fields                         ------ */
#define SIM_FCFG1_FLASHDIS_MASK                  (0x01UL << SIM_FCFG1_FLASHDIS_SHIFT)                /*!< SIM_FCFG1: FLASHDIS Mask                */
#define SIM_FCFG1_FLASHDIS_SHIFT                 0                                                   /*!< SIM_FCFG1: FLASHDIS Position            */
#define SIM_FCFG1_FLASHDOZE_MASK                 (0x01UL << SIM_FCFG1_FLASHDOZE_SHIFT)               /*!< SIM_FCFG1: FLASHDOZE Mask               */
#define SIM_FCFG1_FLASHDOZE_SHIFT                1                                                   /*!< SIM_FCFG1: FLASHDOZE Position           */
#define SIM_FCFG1_PFSIZE_MASK                    (0x0FUL << SIM_FCFG1_PFSIZE_SHIFT)                  /*!< SIM_FCFG1: PFSIZE Mask                  */
#define SIM_FCFG1_PFSIZE_SHIFT                   24                                                  /*!< SIM_FCFG1: PFSIZE Position              */
#define SIM_FCFG1_PFSIZE(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK) /*!< SIM_FCFG1                               */
/* ------- FCFG2 Bit Fields                         ------ */
#define SIM_FCFG2_MAXADDR0_MASK                  (0x7FUL << SIM_FCFG2_MAXADDR0_SHIFT)                /*!< SIM_FCFG2: MAXADDR0 Mask                */
#define SIM_FCFG2_MAXADDR0_SHIFT                 24                                                  /*!< SIM_FCFG2: MAXADDR0 Position            */
#define SIM_FCFG2_MAXADDR0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR0_SHIFT))&SIM_FCFG2_MAXADDR0_MASK) /*!< SIM_FCFG2                               */
/* ------- UIDH Bit Fields                          ------ */
#define SIM_UIDH_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDH_UID_SHIFT)                /*!< SIM_UIDH: UID Mask                      */
#define SIM_UIDH_UID_SHIFT                       0                                                   /*!< SIM_UIDH: UID Position                  */
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDH_UID_SHIFT))&SIM_UIDH_UID_MASK) /*!< SIM_UIDH                                */
/* ------- UIDMH Bit Fields                         ------ */
#define SIM_UIDMH_UID_MASK                       (0xFFFFFFFFUL << SIM_UIDMH_UID_SHIFT)               /*!< SIM_UIDMH: UID Mask                     */
#define SIM_UIDMH_UID_SHIFT                      0                                                   /*!< SIM_UIDMH: UID Position                 */
#define SIM_UIDMH_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID_SHIFT))&SIM_UIDMH_UID_MASK) /*!< SIM_UIDMH                               */
/* ------- UIDML Bit Fields                         ------ */
#define SIM_UIDML_UID_MASK                       (0xFFFFFFFFUL << SIM_UIDML_UID_SHIFT)               /*!< SIM_UIDML: UID Mask                     */
#define SIM_UIDML_UID_SHIFT                      0                                                   /*!< SIM_UIDML: UID Position                 */
#define SIM_UIDML_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID_SHIFT))&SIM_UIDML_UID_MASK) /*!< SIM_UIDML                               */
/* ------- UIDL Bit Fields                          ------ */
#define SIM_UIDL_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDL_UID_SHIFT)                /*!< SIM_UIDL: UID Mask                      */
#define SIM_UIDL_UID_SHIFT                       0                                                   /*!< SIM_UIDL: UID Position                  */
#define SIM_UIDL_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID_SHIFT))&SIM_UIDL_UID_MASK) /*!< SIM_UIDL                                */
/* ------- CLKDIV4 Bit Fields                       ------ */
#define SIM_CLKDIV4_TRACEFRAC_MASK               (0x01UL << SIM_CLKDIV4_TRACEFRAC_SHIFT)             /*!< SIM_CLKDIV4: TRACEFRAC Mask             */
#define SIM_CLKDIV4_TRACEFRAC_SHIFT              0                                                   /*!< SIM_CLKDIV4: TRACEFRAC Position         */
#define SIM_CLKDIV4_TRACEDIV_MASK                (0x07UL << SIM_CLKDIV4_TRACEDIV_SHIFT)              /*!< SIM_CLKDIV4: TRACEDIV Mask              */
#define SIM_CLKDIV4_TRACEDIV_SHIFT               1                                                   /*!< SIM_CLKDIV4: TRACEDIV Position          */
#define SIM_CLKDIV4_TRACEDIV(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV4_TRACEDIV_SHIFT))&SIM_CLKDIV4_TRACEDIV_MASK) /*!< SIM_CLKDIV4                             */
#define SIM_CLKDIV4_TRACEDIVEN_MASK              (0x01UL << SIM_CLKDIV4_TRACEDIVEN_SHIFT)            /*!< SIM_CLKDIV4: TRACEDIVEN Mask            */
#define SIM_CLKDIV4_TRACEDIVEN_SHIFT             28                                                  /*!< SIM_CLKDIV4: TRACEDIVEN Position        */
/* ------- MISCTRL Bit Fields                       ------ */
#define SIM_MISCTRL_CMPWIN0SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN0SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN0SRC Mask            */
#define SIM_MISCTRL_CMPWIN0SRC_SHIFT             8                                                   /*!< SIM_MISCTRL: CMPWIN0SRC Position        */
#define SIM_MISCTRL_CMPWIN0SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN0SRC_SHIFT))&SIM_MISCTRL_CMPWIN0SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_CMPWIN1SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN1SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN1SRC Mask            */
#define SIM_MISCTRL_CMPWIN1SRC_SHIFT             10                                                  /*!< SIM_MISCTRL: CMPWIN1SRC Position        */
#define SIM_MISCTRL_CMPWIN1SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN1SRC_SHIFT))&SIM_MISCTRL_CMPWIN1SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_CMPWIN2SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN2SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN2SRC Mask            */
#define SIM_MISCTRL_CMPWIN2SRC_SHIFT             12                                                  /*!< SIM_MISCTRL: CMPWIN2SRC Position        */
#define SIM_MISCTRL_CMPWIN2SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN2SRC_SHIFT))&SIM_MISCTRL_CMPWIN2SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_CMPWIN3SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN3SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN3SRC Mask            */
#define SIM_MISCTRL_CMPWIN3SRC_SHIFT             14                                                  /*!< SIM_MISCTRL: CMPWIN3SRC Position        */
#define SIM_MISCTRL_CMPWIN3SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN3SRC_SHIFT))&SIM_MISCTRL_CMPWIN3SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_EWMINSRC_MASK                (0x01UL << SIM_MISCTRL_EWMINSRC_SHIFT)              /*!< SIM_MISCTRL: EWMINSRC Mask              */
#define SIM_MISCTRL_EWMINSRC_SHIFT               16                                                  /*!< SIM_MISCTRL: EWMINSRC Position          */
#define SIM_MISCTRL_DACTRIGSRC_MASK              (0x03UL << SIM_MISCTRL_DACTRIGSRC_SHIFT)            /*!< SIM_MISCTRL: DACTRIGSRC Mask            */
#define SIM_MISCTRL_DACTRIGSRC_SHIFT             18                                                  /*!< SIM_MISCTRL: DACTRIGSRC Position        */
#define SIM_MISCTRL_DACTRIGSRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_DACTRIGSRC_SHIFT))&SIM_MISCTRL_DACTRIGSRC_MASK) /*!< SIM_MISCTRL                             */
/* ------- MISCTRL2 Bit Fields                      ------ */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG0 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT     8                                                   /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG0 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG1 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT     9                                                   /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG1 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG2 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT     10                                                  /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG2 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG3 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT     11                                                  /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG3 Position*/
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG0 Mask    */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT     12                                                  /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG0 Position*/
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG1 Mask    */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT     13                                                  /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG1 Position*/
#define SIM_MISCTRL2_SYNCDACHWTRIG_MASK          (0x01UL << SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT)        /*!< SIM_MISCTRL2: SYNCDACHWTRIG Mask        */
