podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
#define SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT         16                                                  /*!< SIM_MISCTRL2: SYNCDACHWTRIG Position    */
#define SIM_MISCTRL2_SYNCEWMIN_MASK              (0x01UL << SIM_MISCTRL2_SYNCEWMIN_SHIFT)            /*!< SIM_MISCTRL2: SYNCEWMIN Mask            */
#define SIM_MISCTRL2_SYNCEWMIN_SHIFT             17                                                  /*!< SIM_MISCTRL2: SYNCEWMIN Position        */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP0SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT     20                                                  /*!< SIM_MISCTRL2: SYNCCMP0SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP1SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT     21                                                  /*!< SIM_MISCTRL2: SYNCCMP1SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP2SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT     22                                                  /*!< SIM_MISCTRL2: SYNCCMP2SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP3SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT     23                                                  /*!< SIM_MISCTRL2: SYNCCMP3SAMPLEWIN Position*/
/* ------- WDOGC Bit Fields                         ------ */
#define SIM_WDOGC_WDOGCLKS_MASK                  (0x01UL << SIM_WDOGC_WDOGCLKS_SHIFT)                /*!< SIM_WDOGC: WDOGCLKS Mask                */
#define SIM_WDOGC_WDOGCLKS_SHIFT                 1                                                   /*!< SIM_WDOGC: WDOGCLKS Position            */
/* ------- PWRC Bit Fields                          ------ */
#define SIM_PWRC_SRPDN_MASK                      (0x03UL << SIM_PWRC_SRPDN_SHIFT)                    /*!< SIM_PWRC: SRPDN Mask                    */
#define SIM_PWRC_SRPDN_SHIFT                     0                                                   /*!< SIM_PWRC: SRPDN Position                */
#define SIM_PWRC_SRPDN(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SRPDN_SHIFT))&SIM_PWRC_SRPDN_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SR27STDBY_MASK                  (0x03UL << SIM_PWRC_SR27STDBY_SHIFT)                /*!< SIM_PWRC: SR27STDBY Mask                */
#define SIM_PWRC_SR27STDBY_SHIFT                 2                                                   /*!< SIM_PWRC: SR27STDBY Position            */
#define SIM_PWRC_SR27STDBY(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SR27STDBY_SHIFT))&SIM_PWRC_SR27STDBY_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SR12STDBY_MASK                  (0x03UL << SIM_PWRC_SR12STDBY_SHIFT)                /*!< SIM_PWRC: SR12STDBY Mask                */
#define SIM_PWRC_SR12STDBY_SHIFT                 6                                                   /*!< SIM_PWRC: SR12STDBY Position            */
#define SIM_PWRC_SR12STDBY(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SR12STDBY_SHIFT))&SIM_PWRC_SR12STDBY_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SRPWRDETEN_MASK                 (0x01UL << SIM_PWRC_SRPWRDETEN_SHIFT)               /*!< SIM_PWRC: SRPWRDETEN Mask               */
#define SIM_PWRC_SRPWRDETEN_SHIFT                8                                                   /*!< SIM_PWRC: SRPWRDETEN Position           */
#define SIM_PWRC_SRPWRRDY_MASK                   (0x01UL << SIM_PWRC_SRPWRRDY_SHIFT)                 /*!< SIM_PWRC: SRPWRRDY Mask                 */
#define SIM_PWRC_SRPWRRDY_SHIFT                  9                                                   /*!< SIM_PWRC: SRPWRRDY Position             */
#define SIM_PWRC_SRPWROK_MASK                    (0x01UL << SIM_PWRC_SRPWROK_SHIFT)                  /*!< SIM_PWRC: SRPWROK Mask                  */
#define SIM_PWRC_SRPWROK_SHIFT                   16                                                  /*!< SIM_PWRC: SRPWROK Position              */
/* ------- ADCOPT Bit Fields                        ------ */
#define SIM_ADCOPT_ADCACH6SEL_MASK               (0x07UL << SIM_ADCOPT_ADCACH6SEL_SHIFT)             /*!< SIM_ADCOPT: ADCACH6SEL Mask             */
#define SIM_ADCOPT_ADCACH6SEL_SHIFT              0                                                   /*!< SIM_ADCOPT: ADCACH6SEL Position         */
#define SIM_ADCOPT_ADCACH6SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCACH6SEL_SHIFT))&SIM_ADCOPT_ADCACH6SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ADCACH7SEL_MASK               (0x07UL << SIM_ADCOPT_ADCACH7SEL_SHIFT)             /*!< SIM_ADCOPT: ADCACH7SEL Mask             */
#define SIM_ADCOPT_ADCACH7SEL_SHIFT              4                                                   /*!< SIM_ADCOPT: ADCACH7SEL Position         */
#define SIM_ADCOPT_ADCACH7SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCACH7SEL_SHIFT))&SIM_ADCOPT_ADCACH7SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ADCBCH6SEL_MASK               (0x07UL << SIM_ADCOPT_ADCBCH6SEL_SHIFT)             /*!< SIM_ADCOPT: ADCBCH6SEL Mask             */
#define SIM_ADCOPT_ADCBCH6SEL_SHIFT              8                                                   /*!< SIM_ADCOPT: ADCBCH6SEL Position         */
#define SIM_ADCOPT_ADCBCH6SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCBCH6SEL_SHIFT))&SIM_ADCOPT_ADCBCH6SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ADCBCH7SEL_MASK               (0x07UL << SIM_ADCOPT_ADCBCH7SEL_SHIFT)             /*!< SIM_ADCOPT: ADCBCH7SEL Mask             */
#define SIM_ADCOPT_ADCBCH7SEL_SHIFT              12                                                  /*!< SIM_ADCOPT: ADCBCH7SEL Position         */
#define SIM_ADCOPT_ADCBCH7SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCBCH7SEL_SHIFT))&SIM_ADCOPT_ADCBCH7SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ROSB_MASK                     (0x01UL << SIM_ADCOPT_ROSB_SHIFT)                   /*!< SIM_ADCOPT: ROSB Mask                   */
#define SIM_ADCOPT_ROSB_SHIFT                    24                                                  /*!< SIM_ADCOPT: ROSB Position               */
#define SIM_ADCOPT_ADCIRCLK_MASK                 (0x01UL << SIM_ADCOPT_ADCIRCLK_SHIFT)               /*!< SIM_ADCOPT: ADCIRCLK Mask               */
#define SIM_ADCOPT_ADCIRCLK_SHIFT                25                                                  /*!< SIM_ADCOPT: ADCIRCLK Position           */
/**
 * @} */ /* End group SIM_Register_Masks_GROUP 
 */

/* SIM - Peripheral instance base addresses */
#define SIM_BasePtr                    0x40047000UL //!< Peripheral base address
#define SIM                            ((SIM_Type *) SIM_BasePtr) //!< Freescale base pointer
#define SIM_BASE_PTR                   (SIM) //!< Freescale style base pointer
/**
 * @} */ /* End group SIM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SMC_Peripheral_access_layer_GROUP SMC Peripheral Access Layer
* @brief C Struct for SMC
* @{
*/

/* ================================================================================ */
/* ================           SMC (file:SMC_MKV40F15)              ================ */
/* ================================================================================ */

/**
 * @brief System Mode Controller
 */
/**
* @addtogroup SMC_structs_GROUP SMC struct
* @brief Struct for SMC
* @{
*/
typedef struct {                                /*       SMC Structure                                                */
   __IO uint8_t   PMPROT;                       /**< 0000: Power Mode Protection register                               */
   __IO uint8_t   PMCTRL;                       /**< 0001: Power Mode Control register                                  */
   __IO uint8_t   STOPCTRL;                     /**< 0002: Stop Control Register                                        */
   __I  uint8_t   PMSTAT;                       /**< 0003: Power Mode Status register                                   */
} SMC_Type;

/**
 * @} */ /* End group SMC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SMC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup SMC_Register_Masks_GROUP SMC Register Masks
* @brief Register Masks for SMC
* @{
*/
/* ------- PMPROT Bit Fields                        ------ */
#define SMC_PMPROT_AVLLS_MASK                    (0x01UL << SMC_PMPROT_AVLLS_SHIFT)                  /*!< SMC_PMPROT: AVLLS Mask                  */
#define SMC_PMPROT_AVLLS_SHIFT                   1                                                   /*!< SMC_PMPROT: AVLLS Position              */
#define SMC_PMPROT_AVLP_MASK                     (0x01UL << SMC_PMPROT_AVLP_SHIFT)                   /*!< SMC_PMPROT: AVLP Mask                   */
#define SMC_PMPROT_AVLP_SHIFT                    5                                                   /*!< SMC_PMPROT: AVLP Position               */
#define SMC_PMPROT_AHSRUN_MASK                   (0x01UL << SMC_PMPROT_AHSRUN_SHIFT)                 /*!< SMC_PMPROT: AHSRUN Mask                 */
#define SMC_PMPROT_AHSRUN_SHIFT                  7                                                   /*!< SMC_PMPROT: AHSRUN Position             */
/* ------- PMCTRL Bit Fields                        ------ */
#define SMC_PMCTRL_STOPM_MASK                    (0x07UL << SMC_PMCTRL_STOPM_SHIFT)                  /*!< SMC_PMCTRL: STOPM Mask                  */
#define SMC_PMCTRL_STOPM_SHIFT                   0                                                   /*!< SMC_PMCTRL: STOPM Position              */
#define SMC_PMCTRL_STOPM(x)                      (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_STOPM_SHIFT))&SMC_PMCTRL_STOPM_MASK) /*!< SMC_PMCTRL                              */
#define SMC_PMCTRL_STOPA_MASK                    (0x01UL << SMC_PMCTRL_STOPA_SHIFT)                  /*!< SMC_PMCTRL: STOPA Mask                  */
#define SMC_PMCTRL_STOPA_SHIFT                   3                                                   /*!< SMC_PMCTRL: STOPA Position              */
#define SMC_PMCTRL_RUNM_MASK                     (0x03UL << SMC_PMCTRL_RUNM_SHIFT)                   /*!< SMC_PMCTRL: RUNM Mask                   */
#define SMC_PMCTRL_RUNM_SHIFT                    5                                                   /*!< SMC_PMCTRL: RUNM Position               */
#define SMC_PMCTRL_RUNM(x)                       (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_RUNM_SHIFT))&SMC_PMCTRL_RUNM_MASK) /*!< SMC_PMCTRL                              */
/* ------- STOPCTRL Bit Fields                      ------ */
#define SMC_STOPCTRL_VLLSM_MASK                  (0x07UL << SMC_STOPCTRL_VLLSM_SHIFT)                /*!< SMC_STOPCTRL: VLLSM Mask                */
#define SMC_STOPCTRL_VLLSM_SHIFT                 0                                                   /*!< SMC_STOPCTRL: VLLSM Position            */
#define SMC_STOPCTRL_VLLSM(x)                    (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_VLLSM_SHIFT))&SMC_STOPCTRL_VLLSM_MASK) /*!< SMC_STOPCTRL                            */
#define SMC_STOPCTRL_LPOPO_MASK                  (0x01UL << SMC_STOPCTRL_LPOPO_SHIFT)                /*!< SMC_STOPCTRL: LPOPO Mask                */
#define SMC_STOPCTRL_LPOPO_SHIFT                 3                                                   /*!< SMC_STOPCTRL: LPOPO Position            */
#define SMC_STOPCTRL_RAM2PO_MASK                 (0x01UL << SMC_STOPCTRL_RAM2PO_SHIFT)               /*!< SMC_STOPCTRL: RAM2PO Mask               */
#define SMC_STOPCTRL_RAM2PO_SHIFT                4                                                   /*!< SMC_STOPCTRL: RAM2PO Position           */
#define SMC_STOPCTRL_PORPO_MASK                  (0x01UL << SMC_STOPCTRL_PORPO_SHIFT)                /*!< SMC_STOPCTRL: PORPO Mask                */
#define SMC_STOPCTRL_PORPO_SHIFT                 5                                                   /*!< SMC_STOPCTRL: PORPO Position            */
#define SMC_STOPCTRL_PSTOPO_MASK                 (0x03UL << SMC_STOPCTRL_PSTOPO_SHIFT)               /*!< SMC_STOPCTRL: PSTOPO Mask               */
#define SMC_STOPCTRL_PSTOPO_SHIFT                6                                                   /*!< SMC_STOPCTRL: PSTOPO Position           */
#define SMC_STOPCTRL_PSTOPO(x)                   (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_PSTOPO_SHIFT))&SMC_STOPCTRL_PSTOPO_MASK) /*!< SMC_STOPCTRL                            */
/* ------- PMSTAT Bit Fields                        ------ */
#define SMC_PMSTAT_PMSTAT_MASK                   (0xFFUL << SMC_PMSTAT_PMSTAT_SHIFT)                 /*!< SMC_PMSTAT: PMSTAT Mask                 */
#define SMC_PMSTAT_PMSTAT_SHIFT                  0                                                   /*!< SMC_PMSTAT: PMSTAT Position             */
#define SMC_PMSTAT_PMSTAT(x)                     (((uint8_t)(((uint8_t)(x))<<SMC_PMSTAT_PMSTAT_SHIFT))&SMC_PMSTAT_PMSTAT_MASK) /*!< SMC_PMSTAT                              */
/**
 * @} */ /* End group SMC_Register_Masks_GROUP 
 */

/* SMC - Peripheral instance base addresses */
#define SMC_BasePtr                    0x4007E000UL //!< Peripheral base address
#define SMC                            ((SMC_Type *) SMC_BasePtr) //!< Freescale base pointer
#define SMC_BASE_PTR                   (SMC) //!< Freescale style base pointer
/**
 * @} */ /* End group SMC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SPI_Peripheral_access_layer_GROUP SPI Peripheral Access Layer
* @brief C Struct for SPI
* @{
*/

/* ================================================================================ */
/* ================           SPI0 (file:SPI0_MKV40F15)            ================ */
/* ================================================================================ */

/**
 * @brief Serial Peripheral Interface
 */
/**
* @addtogroup SPI_structs_GROUP SPI struct
* @brief Struct for SPI
* @{
*/
typedef struct {                                /*       SPI0 Structure                                               */
   __IO uint32_t  MCR;                          /**< 0000: Module Configuration Register                                */
   __I  uint32_t  RESERVED0;                   
   __IO uint32_t  TCR;                          /**< 0008: Transfer Count Register                                      */
   union {                                      /**< 0000: (size=0008)                                                  */
      __IO uint32_t  CTAR[2];                   /**< 000C: Clock and Transfer Attributes Register (In Master Mode)      */
      __IO uint32_t  CTAR_SLAVE;                /**< 000C: Clock and Transfer Attributes Register (In Slave Mode)       */
   };
   __I  uint32_t  RESERVED1[6];                
   __IO uint32_t  SR;                           /**< 002C: Status register                                              */
   __IO uint32_t  RSER;                         /**< 0030: DMA/Interrupt Request Select and Enable Register             */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  PUSHR;                     /**< 0034: PUSH TX FIFO Register In Master Mode                         */
      __IO uint32_t  PUSHR_SLAVE;               /**< 0034: PUSH TX FIFO Register In Slave Mode                          */
   };
   __I  uint32_t  POPR;                         /**< 0038: POP RX FIFO Register                                         */
   __I  uint32_t  TXFR[4];                      /**< 003C: Transmit FIFO                                                */
   __I  uint32_t  RESERVED2[12];               
   __I  uint32_t  RXFR[4];                      /**< 007C: Receive FIFO                                                 */
   __I  uint32_t  RESERVED3[44];               
   __IO uint32_t  SREX;                         /**< 013C: Status register Extended                                     */
} SPI_Type;

/**
 * @} */ /* End group SPI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SPI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

