podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
/* -------------------------------------------------------------------------------- */
/* -----------     'XBARA' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup XBARA_Register_Masks_GROUP XBARA Register Masks
* @brief Register Masks for XBARA
* @{
*/
/* ------- SEL0 Bit Fields                          ------ */
#define XBARA_SEL0_SEL0_MASK                     (0x3FUL << XBARA_SEL0_SEL0_SHIFT)                   /*!< XBARA_SEL0: SEL0 Mask                   */
#define XBARA_SEL0_SEL0_SHIFT                    0                                                   /*!< XBARA_SEL0: SEL0 Position               */
#define XBARA_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL0_SEL0_SHIFT))&XBARA_SEL0_SEL0_MASK) /*!< XBARA_SEL0                              */
#define XBARA_SEL0_SEL1_MASK                     (0x3FUL << XBARA_SEL0_SEL1_SHIFT)                   /*!< XBARA_SEL0: SEL1 Mask                   */
#define XBARA_SEL0_SEL1_SHIFT                    8                                                   /*!< XBARA_SEL0: SEL1 Position               */
#define XBARA_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL0_SEL1_SHIFT))&XBARA_SEL0_SEL1_MASK) /*!< XBARA_SEL0                              */
/* ------- SEL1 Bit Fields                          ------ */
#define XBARA_SEL1_SEL2_MASK                     (0x3FUL << XBARA_SEL1_SEL2_SHIFT)                   /*!< XBARA_SEL1: SEL2 Mask                   */
#define XBARA_SEL1_SEL2_SHIFT                    0                                                   /*!< XBARA_SEL1: SEL2 Position               */
#define XBARA_SEL1_SEL2(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL1_SEL2_SHIFT))&XBARA_SEL1_SEL2_MASK) /*!< XBARA_SEL1                              */
#define XBARA_SEL1_SEL3_MASK                     (0x3FUL << XBARA_SEL1_SEL3_SHIFT)                   /*!< XBARA_SEL1: SEL3 Mask                   */
#define XBARA_SEL1_SEL3_SHIFT                    8                                                   /*!< XBARA_SEL1: SEL3 Position               */
#define XBARA_SEL1_SEL3(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL1_SEL3_SHIFT))&XBARA_SEL1_SEL3_MASK) /*!< XBARA_SEL1                              */
/* ------- SEL2 Bit Fields                          ------ */
#define XBARA_SEL2_SEL4_MASK                     (0x3FUL << XBARA_SEL2_SEL4_SHIFT)                   /*!< XBARA_SEL2: SEL4 Mask                   */
#define XBARA_SEL2_SEL4_SHIFT                    0                                                   /*!< XBARA_SEL2: SEL4 Position               */
#define XBARA_SEL2_SEL4(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL2_SEL4_SHIFT))&XBARA_SEL2_SEL4_MASK) /*!< XBARA_SEL2                              */
#define XBARA_SEL2_SEL5_MASK                     (0x3FUL << XBARA_SEL2_SEL5_SHIFT)                   /*!< XBARA_SEL2: SEL5 Mask                   */
#define XBARA_SEL2_SEL5_SHIFT                    8                                                   /*!< XBARA_SEL2: SEL5 Position               */
#define XBARA_SEL2_SEL5(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL2_SEL5_SHIFT))&XBARA_SEL2_SEL5_MASK) /*!< XBARA_SEL2                              */
/* ------- SEL3 Bit Fields                          ------ */
#define XBARA_SEL3_SEL6_MASK                     (0x3FUL << XBARA_SEL3_SEL6_SHIFT)                   /*!< XBARA_SEL3: SEL6 Mask                   */
#define XBARA_SEL3_SEL6_SHIFT                    0                                                   /*!< XBARA_SEL3: SEL6 Position               */
#define XBARA_SEL3_SEL6(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL3_SEL6_SHIFT))&XBARA_SEL3_SEL6_MASK) /*!< XBARA_SEL3                              */
#define XBARA_SEL3_SEL7_MASK                     (0x3FUL << XBARA_SEL3_SEL7_SHIFT)                   /*!< XBARA_SEL3: SEL7 Mask                   */
#define XBARA_SEL3_SEL7_SHIFT                    8                                                   /*!< XBARA_SEL3: SEL7 Position               */
#define XBARA_SEL3_SEL7(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL3_SEL7_SHIFT))&XBARA_SEL3_SEL7_MASK) /*!< XBARA_SEL3                              */
/* ------- SEL4 Bit Fields                          ------ */
#define XBARA_SEL4_SEL8_MASK                     (0x3FUL << XBARA_SEL4_SEL8_SHIFT)                   /*!< XBARA_SEL4: SEL8 Mask                   */
#define XBARA_SEL4_SEL8_SHIFT                    0                                                   /*!< XBARA_SEL4: SEL8 Position               */
#define XBARA_SEL4_SEL8(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL4_SEL8_SHIFT))&XBARA_SEL4_SEL8_MASK) /*!< XBARA_SEL4                              */
#define XBARA_SEL4_SEL9_MASK                     (0x3FUL << XBARA_SEL4_SEL9_SHIFT)                   /*!< XBARA_SEL4: SEL9 Mask                   */
#define XBARA_SEL4_SEL9_SHIFT                    8                                                   /*!< XBARA_SEL4: SEL9 Position               */
#define XBARA_SEL4_SEL9(x)                       (((uint16_t)(((uint16_t)(x))<<XBARA_SEL4_SEL9_SHIFT))&XBARA_SEL4_SEL9_MASK) /*!< XBARA_SEL4                              */
/* ------- SEL5 Bit Fields                          ------ */
#define XBARA_SEL5_SEL10_MASK                    (0x3FUL << XBARA_SEL5_SEL10_SHIFT)                  /*!< XBARA_SEL5: SEL10 Mask                  */
#define XBARA_SEL5_SEL10_SHIFT                   0                                                   /*!< XBARA_SEL5: SEL10 Position              */
#define XBARA_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL5_SEL10_SHIFT))&XBARA_SEL5_SEL10_MASK) /*!< XBARA_SEL5                              */
#define XBARA_SEL5_SEL11_MASK                    (0x3FUL << XBARA_SEL5_SEL11_SHIFT)                  /*!< XBARA_SEL5: SEL11 Mask                  */
#define XBARA_SEL5_SEL11_SHIFT                   8                                                   /*!< XBARA_SEL5: SEL11 Position              */
#define XBARA_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL5_SEL11_SHIFT))&XBARA_SEL5_SEL11_MASK) /*!< XBARA_SEL5                              */
/* ------- SEL6 Bit Fields                          ------ */
#define XBARA_SEL6_SEL12_MASK                    (0x3FUL << XBARA_SEL6_SEL12_SHIFT)                  /*!< XBARA_SEL6: SEL12 Mask                  */
#define XBARA_SEL6_SEL12_SHIFT                   0                                                   /*!< XBARA_SEL6: SEL12 Position              */
#define XBARA_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL6_SEL12_SHIFT))&XBARA_SEL6_SEL12_MASK) /*!< XBARA_SEL6                              */
#define XBARA_SEL6_SEL13_MASK                    (0x3FUL << XBARA_SEL6_SEL13_SHIFT)                  /*!< XBARA_SEL6: SEL13 Mask                  */
#define XBARA_SEL6_SEL13_SHIFT                   8                                                   /*!< XBARA_SEL6: SEL13 Position              */
#define XBARA_SEL6_SEL13(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL6_SEL13_SHIFT))&XBARA_SEL6_SEL13_MASK) /*!< XBARA_SEL6                              */
/* ------- SEL7 Bit Fields                          ------ */
#define XBARA_SEL7_SEL14_MASK                    (0x3FUL << XBARA_SEL7_SEL14_SHIFT)                  /*!< XBARA_SEL7: SEL14 Mask                  */
#define XBARA_SEL7_SEL14_SHIFT                   0                                                   /*!< XBARA_SEL7: SEL14 Position              */
#define XBARA_SEL7_SEL14(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL7_SEL14_SHIFT))&XBARA_SEL7_SEL14_MASK) /*!< XBARA_SEL7                              */
#define XBARA_SEL7_SEL15_MASK                    (0x3FUL << XBARA_SEL7_SEL15_SHIFT)                  /*!< XBARA_SEL7: SEL15 Mask                  */
#define XBARA_SEL7_SEL15_SHIFT                   8                                                   /*!< XBARA_SEL7: SEL15 Position              */
#define XBARA_SEL7_SEL15(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL7_SEL15_SHIFT))&XBARA_SEL7_SEL15_MASK) /*!< XBARA_SEL7                              */
/* ------- SEL8 Bit Fields                          ------ */
#define XBARA_SEL8_SEL16_MASK                    (0x3FUL << XBARA_SEL8_SEL16_SHIFT)                  /*!< XBARA_SEL8: SEL16 Mask                  */
#define XBARA_SEL8_SEL16_SHIFT                   0                                                   /*!< XBARA_SEL8: SEL16 Position              */
#define XBARA_SEL8_SEL16(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL8_SEL16_SHIFT))&XBARA_SEL8_SEL16_MASK) /*!< XBARA_SEL8                              */
#define XBARA_SEL8_SEL17_MASK                    (0x3FUL << XBARA_SEL8_SEL17_SHIFT)                  /*!< XBARA_SEL8: SEL17 Mask                  */
#define XBARA_SEL8_SEL17_SHIFT                   8                                                   /*!< XBARA_SEL8: SEL17 Position              */
#define XBARA_SEL8_SEL17(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL8_SEL17_SHIFT))&XBARA_SEL8_SEL17_MASK) /*!< XBARA_SEL8                              */
/* ------- SEL9 Bit Fields                          ------ */
#define XBARA_SEL9_SEL18_MASK                    (0x3FUL << XBARA_SEL9_SEL18_SHIFT)                  /*!< XBARA_SEL9: SEL18 Mask                  */
#define XBARA_SEL9_SEL18_SHIFT                   0                                                   /*!< XBARA_SEL9: SEL18 Position              */
#define XBARA_SEL9_SEL18(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL9_SEL18_SHIFT))&XBARA_SEL9_SEL18_MASK) /*!< XBARA_SEL9                              */
#define XBARA_SEL9_SEL19_MASK                    (0x3FUL << XBARA_SEL9_SEL19_SHIFT)                  /*!< XBARA_SEL9: SEL19 Mask                  */
#define XBARA_SEL9_SEL19_SHIFT                   8                                                   /*!< XBARA_SEL9: SEL19 Position              */
#define XBARA_SEL9_SEL19(x)                      (((uint16_t)(((uint16_t)(x))<<XBARA_SEL9_SEL19_SHIFT))&XBARA_SEL9_SEL19_MASK) /*!< XBARA_SEL9                              */
/* ------- SEL10 Bit Fields                         ------ */
#define XBARA_SEL10_SEL20_MASK                   (0x3FUL << XBARA_SEL10_SEL20_SHIFT)                 /*!< XBARA_SEL10: SEL20 Mask                 */
#define XBARA_SEL10_SEL20_SHIFT                  0                                                   /*!< XBARA_SEL10: SEL20 Position             */
#define XBARA_SEL10_SEL20(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL10_SEL20_SHIFT))&XBARA_SEL10_SEL20_MASK) /*!< XBARA_SEL10                             */
#define XBARA_SEL10_SEL21_MASK                   (0x3FUL << XBARA_SEL10_SEL21_SHIFT)                 /*!< XBARA_SEL10: SEL21 Mask                 */
#define XBARA_SEL10_SEL21_SHIFT                  8                                                   /*!< XBARA_SEL10: SEL21 Position             */
#define XBARA_SEL10_SEL21(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL10_SEL21_SHIFT))&XBARA_SEL10_SEL21_MASK) /*!< XBARA_SEL10                             */
/* ------- SEL11 Bit Fields                         ------ */
#define XBARA_SEL11_SEL22_MASK                   (0x3FUL << XBARA_SEL11_SEL22_SHIFT)                 /*!< XBARA_SEL11: SEL22 Mask                 */
#define XBARA_SEL11_SEL22_SHIFT                  0                                                   /*!< XBARA_SEL11: SEL22 Position             */
#define XBARA_SEL11_SEL22(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL11_SEL22_SHIFT))&XBARA_SEL11_SEL22_MASK) /*!< XBARA_SEL11                             */
#define XBARA_SEL11_SEL23_MASK                   (0x3FUL << XBARA_SEL11_SEL23_SHIFT)                 /*!< XBARA_SEL11: SEL23 Mask                 */
#define XBARA_SEL11_SEL23_SHIFT                  8                                                   /*!< XBARA_SEL11: SEL23 Position             */
#define XBARA_SEL11_SEL23(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL11_SEL23_SHIFT))&XBARA_SEL11_SEL23_MASK) /*!< XBARA_SEL11                             */
/* ------- SEL12 Bit Fields                         ------ */
#define XBARA_SEL12_SEL24_MASK                   (0x3FUL << XBARA_SEL12_SEL24_SHIFT)                 /*!< XBARA_SEL12: SEL24 Mask                 */
#define XBARA_SEL12_SEL24_SHIFT                  0                                                   /*!< XBARA_SEL12: SEL24 Position             */
#define XBARA_SEL12_SEL24(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL12_SEL24_SHIFT))&XBARA_SEL12_SEL24_MASK) /*!< XBARA_SEL12                             */
#define XBARA_SEL12_SEL25_MASK                   (0x3FUL << XBARA_SEL12_SEL25_SHIFT)                 /*!< XBARA_SEL12: SEL25 Mask                 */
#define XBARA_SEL12_SEL25_SHIFT                  8                                                   /*!< XBARA_SEL12: SEL25 Position             */
#define XBARA_SEL12_SEL25(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL12_SEL25_SHIFT))&XBARA_SEL12_SEL25_MASK) /*!< XBARA_SEL12                             */
/* ------- SEL13 Bit Fields                         ------ */
#define XBARA_SEL13_SEL26_MASK                   (0x3FUL << XBARA_SEL13_SEL26_SHIFT)                 /*!< XBARA_SEL13: SEL26 Mask                 */
#define XBARA_SEL13_SEL26_SHIFT                  0                                                   /*!< XBARA_SEL13: SEL26 Position             */
#define XBARA_SEL13_SEL26(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL13_SEL26_SHIFT))&XBARA_SEL13_SEL26_MASK) /*!< XBARA_SEL13                             */
#define XBARA_SEL13_SEL27_MASK                   (0x3FUL << XBARA_SEL13_SEL27_SHIFT)                 /*!< XBARA_SEL13: SEL27 Mask                 */
#define XBARA_SEL13_SEL27_SHIFT                  8                                                   /*!< XBARA_SEL13: SEL27 Position             */
#define XBARA_SEL13_SEL27(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL13_SEL27_SHIFT))&XBARA_SEL13_SEL27_MASK) /*!< XBARA_SEL13                             */
/* ------- SEL14 Bit Fields                         ------ */
#define XBARA_SEL14_SEL28_MASK                   (0x3FUL << XBARA_SEL14_SEL28_SHIFT)                 /*!< XBARA_SEL14: SEL28 Mask                 */
#define XBARA_SEL14_SEL28_SHIFT                  0                                                   /*!< XBARA_SEL14: SEL28 Position             */
#define XBARA_SEL14_SEL28(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL14_SEL28_SHIFT))&XBARA_SEL14_SEL28_MASK) /*!< XBARA_SEL14                             */
#define XBARA_SEL14_SEL29_MASK                   (0x3FUL << XBARA_SEL14_SEL29_SHIFT)                 /*!< XBARA_SEL14: SEL29 Mask                 */
#define XBARA_SEL14_SEL29_SHIFT                  8                                                   /*!< XBARA_SEL14: SEL29 Position             */
#define XBARA_SEL14_SEL29(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL14_SEL29_SHIFT))&XBARA_SEL14_SEL29_MASK) /*!< XBARA_SEL14                             */
/* ------- SEL15 Bit Fields                         ------ */
#define XBARA_SEL15_SEL30_MASK                   (0x3FUL << XBARA_SEL15_SEL30_SHIFT)                 /*!< XBARA_SEL15: SEL30 Mask                 */
#define XBARA_SEL15_SEL30_SHIFT                  0                                                   /*!< XBARA_SEL15: SEL30 Position             */
#define XBARA_SEL15_SEL30(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL15_SEL30_SHIFT))&XBARA_SEL15_SEL30_MASK) /*!< XBARA_SEL15                             */
#define XBARA_SEL15_SEL31_MASK                   (0x3FUL << XBARA_SEL15_SEL31_SHIFT)                 /*!< XBARA_SEL15: SEL31 Mask                 */
#define XBARA_SEL15_SEL31_SHIFT                  8                                                   /*!< XBARA_SEL15: SEL31 Position             */
#define XBARA_SEL15_SEL31(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL15_SEL31_SHIFT))&XBARA_SEL15_SEL31_MASK) /*!< XBARA_SEL15                             */
/* ------- SEL16 Bit Fields                         ------ */
#define XBARA_SEL16_SEL32_MASK                   (0x3FUL << XBARA_SEL16_SEL32_SHIFT)                 /*!< XBARA_SEL16: SEL32 Mask                 */
#define XBARA_SEL16_SEL32_SHIFT                  0                                                   /*!< XBARA_SEL16: SEL32 Position             */
#define XBARA_SEL16_SEL32(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL16_SEL32_SHIFT))&XBARA_SEL16_SEL32_MASK) /*!< XBARA_SEL16                             */
#define XBARA_SEL16_SEL33_MASK                   (0x3FUL << XBARA_SEL16_SEL33_SHIFT)                 /*!< XBARA_SEL16: SEL33 Mask                 */
#define XBARA_SEL16_SEL33_SHIFT                  8                                                   /*!< XBARA_SEL16: SEL33 Position             */
#define XBARA_SEL16_SEL33(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL16_SEL33_SHIFT))&XBARA_SEL16_SEL33_MASK) /*!< XBARA_SEL16                             */
/* ------- SEL17 Bit Fields                         ------ */
#define XBARA_SEL17_SEL34_MASK                   (0x3FUL << XBARA_SEL17_SEL34_SHIFT)                 /*!< XBARA_SEL17: SEL34 Mask                 */
#define XBARA_SEL17_SEL34_SHIFT                  0                                                   /*!< XBARA_SEL17: SEL34 Position             */
#define XBARA_SEL17_SEL34(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL17_SEL34_SHIFT))&XBARA_SEL17_SEL34_MASK) /*!< XBARA_SEL17                             */
#define XBARA_SEL17_SEL35_MASK                   (0x3FUL << XBARA_SEL17_SEL35_SHIFT)                 /*!< XBARA_SEL17: SEL35 Mask                 */
#define XBARA_SEL17_SEL35_SHIFT                  8                                                   /*!< XBARA_SEL17: SEL35 Position             */
#define XBARA_SEL17_SEL35(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL17_SEL35_SHIFT))&XBARA_SEL17_SEL35_MASK) /*!< XBARA_SEL17                             */
/* ------- SEL18 Bit Fields                         ------ */
#define XBARA_SEL18_SEL36_MASK                   (0x3FUL << XBARA_SEL18_SEL36_SHIFT)                 /*!< XBARA_SEL18: SEL36 Mask                 */
#define XBARA_SEL18_SEL36_SHIFT                  0                                                   /*!< XBARA_SEL18: SEL36 Position             */
#define XBARA_SEL18_SEL36(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL18_SEL36_SHIFT))&XBARA_SEL18_SEL36_MASK) /*!< XBARA_SEL18                             */
#define XBARA_SEL18_SEL37_MASK                   (0x3FUL << XBARA_SEL18_SEL37_SHIFT)                 /*!< XBARA_SEL18: SEL37 Mask                 */
#define XBARA_SEL18_SEL37_SHIFT                  8                                                   /*!< XBARA_SEL18: SEL37 Position             */
#define XBARA_SEL18_SEL37(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL18_SEL37_SHIFT))&XBARA_SEL18_SEL37_MASK) /*!< XBARA_SEL18                             */
/* ------- SEL19 Bit Fields                         ------ */
#define XBARA_SEL19_SEL38_MASK                   (0x3FUL << XBARA_SEL19_SEL38_SHIFT)                 /*!< XBARA_SEL19: SEL38 Mask                 */
#define XBARA_SEL19_SEL38_SHIFT                  0                                                   /*!< XBARA_SEL19: SEL38 Position             */
#define XBARA_SEL19_SEL38(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL19_SEL38_SHIFT))&XBARA_SEL19_SEL38_MASK) /*!< XBARA_SEL19                             */
#define XBARA_SEL19_SEL39_MASK                   (0x3FUL << XBARA_SEL19_SEL39_SHIFT)                 /*!< XBARA_SEL19: SEL39 Mask                 */
#define XBARA_SEL19_SEL39_SHIFT                  8                                                   /*!< XBARA_SEL19: SEL39 Position             */
#define XBARA_SEL19_SEL39(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL19_SEL39_SHIFT))&XBARA_SEL19_SEL39_MASK) /*!< XBARA_SEL19                             */
/* ------- SEL20 Bit Fields                         ------ */
#define XBARA_SEL20_SEL40_MASK                   (0x3FUL << XBARA_SEL20_SEL40_SHIFT)                 /*!< XBARA_SEL20: SEL40 Mask                 */
#define XBARA_SEL20_SEL40_SHIFT                  0                                                   /*!< XBARA_SEL20: SEL40 Position             */
#define XBARA_SEL20_SEL40(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL20_SEL40_SHIFT))&XBARA_SEL20_SEL40_MASK) /*!< XBARA_SEL20                             */
#define XBARA_SEL20_SEL41_MASK                   (0x3FUL << XBARA_SEL20_SEL41_SHIFT)                 /*!< XBARA_SEL20: SEL41 Mask                 */
#define XBARA_SEL20_SEL41_SHIFT                  8                                                   /*!< XBARA_SEL20: SEL41 Position             */
#define XBARA_SEL20_SEL41(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL20_SEL41_SHIFT))&XBARA_SEL20_SEL41_MASK) /*!< XBARA_SEL20                             */
/* ------- SEL21 Bit Fields                         ------ */
#define XBARA_SEL21_SEL42_MASK                   (0x3FUL << XBARA_SEL21_SEL42_SHIFT)                 /*!< XBARA_SEL21: SEL42 Mask                 */
#define XBARA_SEL21_SEL42_SHIFT                  0                                                   /*!< XBARA_SEL21: SEL42 Position             */
#define XBARA_SEL21_SEL42(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL21_SEL42_SHIFT))&XBARA_SEL21_SEL42_MASK) /*!< XBARA_SEL21                             */
#define XBARA_SEL21_SEL43_MASK                   (0x3FUL << XBARA_SEL21_SEL43_SHIFT)                 /*!< XBARA_SEL21: SEL43 Mask                 */
#define XBARA_SEL21_SEL43_SHIFT                  8                                                   /*!< XBARA_SEL21: SEL43 Position             */
#define XBARA_SEL21_SEL43(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL21_SEL43_SHIFT))&XBARA_SEL21_SEL43_MASK) /*!< XBARA_SEL21                             */
/* ------- SEL22 Bit Fields                         ------ */
#define XBARA_SEL22_SEL44_MASK                   (0x3FUL << XBARA_SEL22_SEL44_SHIFT)                 /*!< XBARA_SEL22: SEL44 Mask                 */
#define XBARA_SEL22_SEL44_SHIFT                  0                                                   /*!< XBARA_SEL22: SEL44 Position             */
#define XBARA_SEL22_SEL44(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL22_SEL44_SHIFT))&XBARA_SEL22_SEL44_MASK) /*!< XBARA_SEL22                             */
#define XBARA_SEL22_SEL45_MASK                   (0x3FUL << XBARA_SEL22_SEL45_SHIFT)                 /*!< XBARA_SEL22: SEL45 Mask                 */
#define XBARA_SEL22_SEL45_SHIFT                  8                                                   /*!< XBARA_SEL22: SEL45 Position             */
#define XBARA_SEL22_SEL45(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL22_SEL45_SHIFT))&XBARA_SEL22_SEL45_MASK) /*!< XBARA_SEL22                             */
/* ------- SEL23 Bit Fields                         ------ */
#define XBARA_SEL23_SEL46_MASK                   (0x3FUL << XBARA_SEL23_SEL46_SHIFT)                 /*!< XBARA_SEL23: SEL46 Mask                 */
#define XBARA_SEL23_SEL46_SHIFT                  0                                                   /*!< XBARA_SEL23: SEL46 Position             */
