podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV45F15.h
#define XBARA_SEL23_SEL46(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL23_SEL46_SHIFT))&XBARA_SEL23_SEL46_MASK) /*!< XBARA_SEL23                             */
#define XBARA_SEL23_SEL47_MASK                   (0x3FUL << XBARA_SEL23_SEL47_SHIFT)                 /*!< XBARA_SEL23: SEL47 Mask                 */
#define XBARA_SEL23_SEL47_SHIFT                  8                                                   /*!< XBARA_SEL23: SEL47 Position             */
#define XBARA_SEL23_SEL47(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL23_SEL47_SHIFT))&XBARA_SEL23_SEL47_MASK) /*!< XBARA_SEL23                             */
/* ------- SEL24 Bit Fields                         ------ */
#define XBARA_SEL24_SEL48_MASK                   (0x3FUL << XBARA_SEL24_SEL48_SHIFT)                 /*!< XBARA_SEL24: SEL48 Mask                 */
#define XBARA_SEL24_SEL48_SHIFT                  0                                                   /*!< XBARA_SEL24: SEL48 Position             */
#define XBARA_SEL24_SEL48(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL24_SEL48_SHIFT))&XBARA_SEL24_SEL48_MASK) /*!< XBARA_SEL24                             */
#define XBARA_SEL24_SEL49_MASK                   (0x3FUL << XBARA_SEL24_SEL49_SHIFT)                 /*!< XBARA_SEL24: SEL49 Mask                 */
#define XBARA_SEL24_SEL49_SHIFT                  8                                                   /*!< XBARA_SEL24: SEL49 Position             */
#define XBARA_SEL24_SEL49(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL24_SEL49_SHIFT))&XBARA_SEL24_SEL49_MASK) /*!< XBARA_SEL24                             */
/* ------- SEL25 Bit Fields                         ------ */
#define XBARA_SEL25_SEL50_MASK                   (0x3FUL << XBARA_SEL25_SEL50_SHIFT)                 /*!< XBARA_SEL25: SEL50 Mask                 */
#define XBARA_SEL25_SEL50_SHIFT                  0                                                   /*!< XBARA_SEL25: SEL50 Position             */
#define XBARA_SEL25_SEL50(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL25_SEL50_SHIFT))&XBARA_SEL25_SEL50_MASK) /*!< XBARA_SEL25                             */
#define XBARA_SEL25_SEL51_MASK                   (0x3FUL << XBARA_SEL25_SEL51_SHIFT)                 /*!< XBARA_SEL25: SEL51 Mask                 */
#define XBARA_SEL25_SEL51_SHIFT                  8                                                   /*!< XBARA_SEL25: SEL51 Position             */
#define XBARA_SEL25_SEL51(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL25_SEL51_SHIFT))&XBARA_SEL25_SEL51_MASK) /*!< XBARA_SEL25                             */
/* ------- SEL26 Bit Fields                         ------ */
#define XBARA_SEL26_SEL52_MASK                   (0x3FUL << XBARA_SEL26_SEL52_SHIFT)                 /*!< XBARA_SEL26: SEL52 Mask                 */
#define XBARA_SEL26_SEL52_SHIFT                  0                                                   /*!< XBARA_SEL26: SEL52 Position             */
#define XBARA_SEL26_SEL52(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL26_SEL52_SHIFT))&XBARA_SEL26_SEL52_MASK) /*!< XBARA_SEL26                             */
#define XBARA_SEL26_SEL53_MASK                   (0x3FUL << XBARA_SEL26_SEL53_SHIFT)                 /*!< XBARA_SEL26: SEL53 Mask                 */
#define XBARA_SEL26_SEL53_SHIFT                  8                                                   /*!< XBARA_SEL26: SEL53 Position             */
#define XBARA_SEL26_SEL53(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL26_SEL53_SHIFT))&XBARA_SEL26_SEL53_MASK) /*!< XBARA_SEL26                             */
/* ------- SEL27 Bit Fields                         ------ */
#define XBARA_SEL27_SEL54_MASK                   (0x3FUL << XBARA_SEL27_SEL54_SHIFT)                 /*!< XBARA_SEL27: SEL54 Mask                 */
#define XBARA_SEL27_SEL54_SHIFT                  0                                                   /*!< XBARA_SEL27: SEL54 Position             */
#define XBARA_SEL27_SEL54(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL27_SEL54_SHIFT))&XBARA_SEL27_SEL54_MASK) /*!< XBARA_SEL27                             */
#define XBARA_SEL27_SEL55_MASK                   (0x3FUL << XBARA_SEL27_SEL55_SHIFT)                 /*!< XBARA_SEL27: SEL55 Mask                 */
#define XBARA_SEL27_SEL55_SHIFT                  8                                                   /*!< XBARA_SEL27: SEL55 Position             */
#define XBARA_SEL27_SEL55(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL27_SEL55_SHIFT))&XBARA_SEL27_SEL55_MASK) /*!< XBARA_SEL27                             */
/* ------- SEL28 Bit Fields                         ------ */
#define XBARA_SEL28_SEL56_MASK                   (0x3FUL << XBARA_SEL28_SEL56_SHIFT)                 /*!< XBARA_SEL28: SEL56 Mask                 */
#define XBARA_SEL28_SEL56_SHIFT                  0                                                   /*!< XBARA_SEL28: SEL56 Position             */
#define XBARA_SEL28_SEL56(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL28_SEL56_SHIFT))&XBARA_SEL28_SEL56_MASK) /*!< XBARA_SEL28                             */
#define XBARA_SEL28_SEL57_MASK                   (0x3FUL << XBARA_SEL28_SEL57_SHIFT)                 /*!< XBARA_SEL28: SEL57 Mask                 */
#define XBARA_SEL28_SEL57_SHIFT                  8                                                   /*!< XBARA_SEL28: SEL57 Position             */
#define XBARA_SEL28_SEL57(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL28_SEL57_SHIFT))&XBARA_SEL28_SEL57_MASK) /*!< XBARA_SEL28                             */
/* ------- SEL29 Bit Fields                         ------ */
#define XBARA_SEL29_SEL58_MASK                   (0x3FUL << XBARA_SEL29_SEL58_SHIFT)                 /*!< XBARA_SEL29: SEL58 Mask                 */
#define XBARA_SEL29_SEL58_SHIFT                  0                                                   /*!< XBARA_SEL29: SEL58 Position             */
#define XBARA_SEL29_SEL58(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_SEL29_SEL58_SHIFT))&XBARA_SEL29_SEL58_MASK) /*!< XBARA_SEL29                             */
/* ------- CTRL0 Bit Fields                         ------ */
#define XBARA_CTRL0_DEN0_MASK                    (0x01UL << XBARA_CTRL0_DEN0_SHIFT)                  /*!< XBARA_CTRL0: DEN0 Mask                  */
#define XBARA_CTRL0_DEN0_SHIFT                   0                                                   /*!< XBARA_CTRL0: DEN0 Position              */
#define XBARA_CTRL0_IEN0_MASK                    (0x01UL << XBARA_CTRL0_IEN0_SHIFT)                  /*!< XBARA_CTRL0: IEN0 Mask                  */
#define XBARA_CTRL0_IEN0_SHIFT                   1                                                   /*!< XBARA_CTRL0: IEN0 Position              */
#define XBARA_CTRL0_EDGE0_MASK                   (0x03UL << XBARA_CTRL0_EDGE0_SHIFT)                 /*!< XBARA_CTRL0: EDGE0 Mask                 */
#define XBARA_CTRL0_EDGE0_SHIFT                  2                                                   /*!< XBARA_CTRL0: EDGE0 Position             */
#define XBARA_CTRL0_EDGE0(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_CTRL0_EDGE0_SHIFT))&XBARA_CTRL0_EDGE0_MASK) /*!< XBARA_CTRL0                             */
#define XBARA_CTRL0_STS0_MASK                    (0x01UL << XBARA_CTRL0_STS0_SHIFT)                  /*!< XBARA_CTRL0: STS0 Mask                  */
#define XBARA_CTRL0_STS0_SHIFT                   4                                                   /*!< XBARA_CTRL0: STS0 Position              */
#define XBARA_CTRL0_DEN1_MASK                    (0x01UL << XBARA_CTRL0_DEN1_SHIFT)                  /*!< XBARA_CTRL0: DEN1 Mask                  */
#define XBARA_CTRL0_DEN1_SHIFT                   8                                                   /*!< XBARA_CTRL0: DEN1 Position              */
#define XBARA_CTRL0_IEN1_MASK                    (0x01UL << XBARA_CTRL0_IEN1_SHIFT)                  /*!< XBARA_CTRL0: IEN1 Mask                  */
#define XBARA_CTRL0_IEN1_SHIFT                   9                                                   /*!< XBARA_CTRL0: IEN1 Position              */
#define XBARA_CTRL0_EDGE1_MASK                   (0x03UL << XBARA_CTRL0_EDGE1_SHIFT)                 /*!< XBARA_CTRL0: EDGE1 Mask                 */
#define XBARA_CTRL0_EDGE1_SHIFT                  10                                                  /*!< XBARA_CTRL0: EDGE1 Position             */
#define XBARA_CTRL0_EDGE1(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_CTRL0_EDGE1_SHIFT))&XBARA_CTRL0_EDGE1_MASK) /*!< XBARA_CTRL0                             */
#define XBARA_CTRL0_STS1_MASK                    (0x01UL << XBARA_CTRL0_STS1_SHIFT)                  /*!< XBARA_CTRL0: STS1 Mask                  */
#define XBARA_CTRL0_STS1_SHIFT                   12                                                  /*!< XBARA_CTRL0: STS1 Position              */
/* ------- CTRL1 Bit Fields                         ------ */
#define XBARA_CTRL1_DEN2_MASK                    (0x01UL << XBARA_CTRL1_DEN2_SHIFT)                  /*!< XBARA_CTRL1: DEN2 Mask                  */
#define XBARA_CTRL1_DEN2_SHIFT                   0                                                   /*!< XBARA_CTRL1: DEN2 Position              */
#define XBARA_CTRL1_IEN2_MASK                    (0x01UL << XBARA_CTRL1_IEN2_SHIFT)                  /*!< XBARA_CTRL1: IEN2 Mask                  */
#define XBARA_CTRL1_IEN2_SHIFT                   1                                                   /*!< XBARA_CTRL1: IEN2 Position              */
#define XBARA_CTRL1_EDGE2_MASK                   (0x03UL << XBARA_CTRL1_EDGE2_SHIFT)                 /*!< XBARA_CTRL1: EDGE2 Mask                 */
#define XBARA_CTRL1_EDGE2_SHIFT                  2                                                   /*!< XBARA_CTRL1: EDGE2 Position             */
#define XBARA_CTRL1_EDGE2(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_CTRL1_EDGE2_SHIFT))&XBARA_CTRL1_EDGE2_MASK) /*!< XBARA_CTRL1                             */
#define XBARA_CTRL1_STS2_MASK                    (0x01UL << XBARA_CTRL1_STS2_SHIFT)                  /*!< XBARA_CTRL1: STS2 Mask                  */
#define XBARA_CTRL1_STS2_SHIFT                   4                                                   /*!< XBARA_CTRL1: STS2 Position              */
#define XBARA_CTRL1_DEN3_MASK                    (0x01UL << XBARA_CTRL1_DEN3_SHIFT)                  /*!< XBARA_CTRL1: DEN3 Mask                  */
#define XBARA_CTRL1_DEN3_SHIFT                   8                                                   /*!< XBARA_CTRL1: DEN3 Position              */
#define XBARA_CTRL1_IEN3_MASK                    (0x01UL << XBARA_CTRL1_IEN3_SHIFT)                  /*!< XBARA_CTRL1: IEN3 Mask                  */
#define XBARA_CTRL1_IEN3_SHIFT                   9                                                   /*!< XBARA_CTRL1: IEN3 Position              */
#define XBARA_CTRL1_EDGE3_MASK                   (0x03UL << XBARA_CTRL1_EDGE3_SHIFT)                 /*!< XBARA_CTRL1: EDGE3 Mask                 */
#define XBARA_CTRL1_EDGE3_SHIFT                  10                                                  /*!< XBARA_CTRL1: EDGE3 Position             */
#define XBARA_CTRL1_EDGE3(x)                     (((uint16_t)(((uint16_t)(x))<<XBARA_CTRL1_EDGE3_SHIFT))&XBARA_CTRL1_EDGE3_MASK) /*!< XBARA_CTRL1                             */
#define XBARA_CTRL1_STS3_MASK                    (0x01UL << XBARA_CTRL1_STS3_SHIFT)                  /*!< XBARA_CTRL1: STS3 Mask                  */
#define XBARA_CTRL1_STS3_SHIFT                   12                                                  /*!< XBARA_CTRL1: STS3 Position              */
/**
 * @} */ /* End group XBARA_Register_Masks_GROUP 
 */

